{"Author": "John Fitzgerald", "Date": "October 9, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Android app has nice layout but also has a bug, when programming the dual outlet into a scene, the bottom outlet refuses to respond to the off command, if programmed with an ios device,  the outlet responds correctly. Insteon support said they would call me back on this issue, its been 4 days and i am still waiting. The insteon line overall is a great and affordable way to automate your lighting system. It has been rock solid, easy to install and a great value for the money. Fix the android bug and it will get 5 stars from me."}
{"Author": "Michael Adelman", "Date": "September 20, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\"></span> The app works but has limitations.  On level is not configurable, no matter what the setting is the switch comes on to full level. Would be nice to be able to add custom icons. App freezes every once in a while. The interface is as basic as can be. It constantly runs in the background, draining the battery."}
{"Author": "", "Date": "October 1, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\"></span> The app functions correctly but is slow to load and login, there are no widgets or hot keys, and interaction with nest thermostat is spotty. It needs a makeover badly. If I didn't already invest in insteon hardware I'd use others Update: many updates later and reliability of hub/app is not improved. You need a home controller to do anything serious. I can't believe I'm saying this considering my early adoption, but avoid Insteon."}
{"Author": "Derek Weber", "Date": "October 5, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Extremely outdated. Needs a major overhaul. Hard to use and not yet friendly. Scene schedules don't seem to be working yet they are all set up correctly and turn on/off if you do it manually. If I didn't already have money invested in this hardware I'd be getting something else that works better."}
{"Author": "KNGPIN GANGSTA", "Date": "September 27, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> This app without a doubt sucks! I've had insteon products since 08 my entire home is outfitted with switches and lamplinks. 15 light switched are duds and the remaining lamp links are on their way out. This app constantly crashes. I've submitted complains to smarthome and they claim to have someone on the case. This was 3 months ago. I'm going to find another product to invest in that is more reliable that this garbage! You pay premium​ price for a sub par product. I'm done with you insteon!"}
{"Author": "Davor Balzar", "Date": "September 28, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> This is really weird. Just got new Note8 and it doesn't want to connect to the hub. It worked with Galaxy S8 and still works fine through Alexa, which means that it's about disliking Note8. Any ideas, please?"}
{"Author": "Adam Sperber", "Date": "October 15, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Horribly designed app. Non-intuitive, when is Insteon going to listen and build a NEW app?????? Hello? Is anyone there?"}
{"Author": "Joe Webb", "Date": "September 20, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> This App sucks!!!!!   Says it can't connect to my \"HUB\" but shows it found my WI FI with no further options but to start over with the same \"DEAD END\" results.  I regret ever buying a device that evidently is outdated and no one ever tried the APP with their device."}
{"Author": "Chris Lockhart", "Date": "October 17, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> This app is garbage. It's full of bugs and unrecoverable errors. Especially annoying this is the ONLY front end application that can control the very expensive insteon switches."}
{"Author": "Mark Augustine", "Date": "October 10, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Has been very finicky booting since recent update. Keeps going back to the login screen or sometimes screen just goes black."}
{"Author": "logmeindog", "Date": "October 11, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> With latest update, app no longer opens. Just pops up then closes, pops up then closes. Worthless!! -galaxy S8"}
{"Author": "Madhu Chandrakumar", "Date": "September 20, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Due for a much needed update to UI and overall performance.  Significantly drains the battery because of the poorly optimized app."}
{"Author": "Tom Lastname", "Date": "September 19, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Waaaaaay outdated design. In a serious need for an overhaul."}
{"Author": "Victor Medina", "Date": "September 29, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\"></span> It's ok does the job"}
{"Author": "David Setton", "Date": "July 26, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> The entire app needs to be overhauled with more android specific functionality.  The use of widgets would be a huge help as some of the other reviews mention.  Also, some tasks could easily be reduced to 1 step instead of 2.  God knows why they have a switch icon that doesn't give the ability to dim and brighten the light right away (only on and off).  This should be the first thing that is addressed."}
{"Author": "Andrew Rossignol", "Date": "July 27, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> The UI is outdated. They finally fixed connectivity issues when switching between networks that I reported months ago. I am moving soon and will probably switch automation systems rather than buying more insteon modules unless this app gets more attention."}
{"Author": "J H", "Date": "August 30, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\"></span> I have been using this app for 3 years.  It has not changed and it is totally outdated now. It constantly has trouble connecting. If I did not have 10 devices on insteon I would have changed systems by now. Every other monitoring app allows the screen to enlarge the camera. Are you ever going to update this app?"}
{"Author": "Ashley Stevens", "Date": "August 29, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Device maintenance on my Samsung S7 says that this is a battery-wasting app and it seems that's the case. So don't leave this app in the background when not using it as it will drain your battery. Otherwise, it is what it is, it's very limited but seems to work for me. I also have SmartThings and apart from hardware-based Insteon linking (with the buttons on the switches) I do all automation within SmartThings. There's groovy code out there for the SmartThings IDE to integrate Insteon switches and dimmers which is all I use, mainly for the Keylinc keypads which no other manufacturer has."}
{"Author": "Don LeGower", "Date": "August 23, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Totally looses time if power goes off.  Should synchronize to the internet, it has ethernet! can't deal with daylight savings change,  app doesnt display hub time, so to reset the hub time you have to sign in with a computer. The only updates they make are to sell new products.  overall rates just about zero. If it can't keep time, it's useless. The fact that it can't display it's time is also just ridiculous....."}
{"Author": "Anthony Lombardo", "Date": "August 24, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> I'm terribly disappointed in this app. I recognize the source code also. A lot of people are using it. It has very limited capabilities in my opinion. Ive seen free apps that do better if they would only get rid of those intrusive ads. The Camera portion is just completely useless. All you can do with it basically is look to see whats there. none of the other functions work well at all. And I just found out they are no longer supporting it and I just bought one last week. ERR"}
{"Author": "Ryan Unash", "Date": "August 28, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> App successfully authenticates but never connects to the hub on my nexus 6p but works fine on my fiancés nexus 5x. Waited months for support to fix it but they have been no help. Horrible app and service"}
{"Author": "Chris Beran", "Date": "July 27, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Terrible connectivity, apparently only connects to the phones it wants to. Have the exact same pbone as my father, it works on his, not on mine. I've found better quality in a kids meal toy."}
{"Author": "Brad J", "Date": "August 1, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Just realized that all of my Motion Sensors and Open/Close sensors are no longer sending notifications or show a status even though the scenes are working fine. (lights turn on and off when walking by a MS) Swapped out batteries but no change. When I check the  Plug In Modules and I/O Link modules they all show correct status changes and can be controlled by the app. I removed and re-added my OC sensors and they started statusing and send push notifications again. Bummer - this means I have to spend a couple of hours reprogramming all my Motion Sensors and scenes. The hardware is great but the App has long been a thorn. Have several out buildings so need the power band and relay feature. Got 3 of these hubs at three sites but last year I stopped buying Insteon and have been purchasing"}
{"Author": "Dru Yoder", "Date": "September 4, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> The ui is in need of a huge update and the application always has issues connecting.  Most of the time the app opens and then shuts down all on its own."}
{"Author": "Sal Battaglia", "Date": "July 27, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Waste of Money. Do not buy Insteon products. Update made all of my devices unknown and I need to factory reset all of them. I have 20 devices. Not acceptable."}
{"Author": "Bill Doerfler", "Date": "September 19, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> It works, just slow and plodding. Feels like an app from 5 it 6 years ago. Can be a bit of a pain to use on occasion, and I can't tell if that is because I'm off my home network not."}
{"Author": "Douglas York II", "Date": "September 19, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Adding a new device is not intuitive.  Neither is changing it's settings.  Not happy an Internet connection is required for scheduling.  IMO the events should be saved in the hub."}
{"Author": "Chad Shumway", "Date": "July 29, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Hard to believe this is the 21st century.  This app is very lackluster for a total home control system. At least the apple version auto rotates."}
{"Author": "William Kutzler", "Date": "September 3, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\"></span> You can't control anything until you manually poll the config from the hub, otherwise it'll loop back every time you try to control a device. Every time you open the app it should poll the hub."}
{"Author": "", "Date": "August 2, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\"></span> The image does not auto-rotate to full screen when turning phone on its side.  Please incorporate this feature Please!  Otherwise works well for the money."}
{"Author": "Anner J. bonilla", "Date": "July 31, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Cannot find the stupid hub even if it's on the network and the debug menu is accessible from my web browser."}
{"Author": "Brandon Bey", "Date": "July 30, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Make other keypad buttons work in stringify please. Main on and off is not enough."}
{"Author": "Josh Brewer", "Date": "August 1, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Works great with my Galaxy s8. One bug I noticed is that the light on/off toggle does not work when power saving is on, which isn't crutial for me."}
{"Author": "Justin Cramer", "Date": "July 27, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Major improvement in app load speed. It's nearly tolerable as a useful application now."}
{"Author": "Jennifer Lewis", "Date": "July 26, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Drains my battery."}
{"Author": "", "Date": "July 30, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Camera came with no instructions  I hate it"}
{"Author": "Erick Perez", "Date": "June 11, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\"></span> As soon as I leave and my phone switches over to LTE, the app pops up saying it lost its connection to my hub. Highly annoying.    As far as the rest of the app, it works and that's about it. App hasn't changed much since it's debut and it shows. UI is extremely outdated and several old bugs remain unfixed. Insteon as a whole is behind the curve on home automation despite being one of the oldest companies in the game.  I'm ditching Insteon as soon as I can."}
{"Author": "John G", "Date": "May 22, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> I've never been able to connect to the hub during initial set-up for the last 3 months. I bought this product from Costco brand new and have never been able to use it. Very bad product. Not user friendly. Read all the other reviews. I'm not alone on this. Stay away! Don't waste your money."}
{"Author": "John Robb", "Date": "July 13, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Insteon was a great idea.   I've invested over $1500 in equipping my house with Insteon devices and now I'm regretting it.  The android app is not keeping pace with eh iOS app.    I had to upgrade my hub to get access to my Logitech Harmony remotes.  I still can't access my Sonos devices even though this is a feature found on the iOS version for over a year.    Yes the app turns on my lights but that's about all I can use it for."}
{"Author": "Rob Mastronicola", "Date": "May 4, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> I am so fed up with this app. If I didn't have so much money invested I would never use insteon again. Horrendous interface. GET OUT WHILE YOU CAN. Been a user for 3 years and have not seen any huge improvements to functionality or usability. Wish they focused on Android as much as they do iOS."}
{"Author": "Alan henson", "Date": "March 5, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Why do I have to restart and put in my password everyone I open this app. It's terrible. I love my insteon products by this app makes me want to buy another brand and switch them all out. Insteon you are seriously hurting your product with this app. You're lucky Alexa came along."}
{"Author": "Douglas Blaikie", "Date": "May 8, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Not working... AGAIN.... new update pushed out to app a couple of days ago. Today hub decides it doesn't want to talk to anything..... Whole house is configured with insteon. So when it doesn't work the word \"frustrating\" just doesn't cut it."}
{"Author": "", "Date": "July 11, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\"></span> I've had the Insteon system for 4 plus years in two separate homes and it has worked flawlessly from the start.  I suspect that most users with problems don't really know how to set up or use the system.  I have about 12 devices connected including cameras, all work well all the time."}
{"Author": "Tim M.", "Date": "June 20, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> When the user brings up the app a second time, it has lost contact with the devices and cannot regain. The user must then press the back button a couple of times I'm so the system can log itself in again at which point it will properly determine the status of each device and allow the user to control them again. In contrast my alarm app and garage door controller app are always ready to go with the proper status whenever opened! So there's no reason insteon can't be as reliable. Otherwise their products themselves get four or five stars from me! Just not the stupid app."}
{"Author": "Kurt Sanger", "Date": "May 23, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Still does not see keypads.  Even after updating app and hub.  Updating hub requires manually recording, deleting, and reinstalling every device.   Otherwise it's great.  But I wanted to program 4 button keypad to control a scene and you may not."}
{"Author": "George Karayiannis", "Date": "March 17, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> This app does not allow you to customize or move the order of icons for Devices/Rooms/Scenes. They are placed automatically in Alphabetical order and that it. You have to live with it!! Also, one of the most annoying things is that for the 6 or 8 key dimmer switches, it doesn't come up as how it looks. It comes up as a basic switch, and then you have to click on the \"+\" every time, in order to expand it to view the whole keypad. Ridiculous! This should have been an option in the settings to choose default. By the way, if your hub doesn't have Internet, it is impossible to connect through your phone over Wifi to set anything up. The hub ALWAY needs to be able to reach the cloud, otherwise consider this whole system a paperweight."}
{"Author": "Andrey Chepurnoy", "Date": "June 29, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Super basic UI, especially compared to the iOS version. Issue with connection being lost if the app idles in the background for longer than 10 minutes. The app will open and devices will sit there attempting to update their status forever. App must then be force quit and restarted. This was reported to Insteon in January 2017 and has not been address as of this writing in June 2017. The problem is reproduced on both my Android phones."}
{"Author": "777 Equanimity", "Date": "May 7, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Money for hub, money for cameras and a big waste of time. First hub went out now second one fails to connect. Reset everything and still nothing. I am totally fed up with this app and brand. Tells you to update app, but when you go to app there is no update available. If not resolved soon, will be going to something else!"}
{"Author": "Jonathan Baker", "Date": "July 10, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Has serious issues. Will not reauthenticate if opened from a suspended state, leaving no way to control lights. Nothing like messing with my phone just so I can see my stairs. Very poorly coded."}
{"Author": "", "Date": "April 2, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Why did i just pay $90 for the hub and have issues with this?? I think this is scammish because you woo people in to buy hub and camera doesnt function like before either SMDH. wtf Look at NEST CAM APP. 4 STARS PLUS ALL THEIR PRODUCTS WORKS IN ONE APP"}
{"Author": "Bruno Silvino", "Date": "February 23, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Does what it is supposed to do. How come no android wear support yet? I don't understand why I cannot set the public IP address manually. My Hub is getting the wrong IP and I can't access remotely. Very disappointed."}
{"Author": "Richard H.", "Date": "June 14, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Possibly the worst app ever made. Unreliable and you have to back out of it any time your screen locks. By the time this app connects to the hub, you could have gotten up and turned on the light. Worthless. Let a third party make alternate apps for your system since you are inept."}
{"Author": "Ricardo Palhano", "Date": "May 20, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Causes orphaned scenes and broken links between devices, when it gets stuck half way creating links, which happens frequently.  Have to force close multiple times throughout day to get status."}
{"Author": "Andy Miller", "Date": "April 12, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Every time I want to use this app, I have to kill it in my app manager and relaunch it. Otherwise it hangs indefinitely trying to reload the current hub state."}
{"Author": "David LaRocque", "Date": "May 12, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> App won't stop notifications when I set it not to in Android's notification settings. The visuals stop, but the sounds keep coming. It's really annoying when a bunch are queued up, then all come beeping on in."}
{"Author": "Andrew Bates", "Date": "July 24, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> The workflow is frustrating and the pairing is problematic. I had to use an iOS device to add the dimming ballast (2475DA2) as it would not complete using the Android app."}
{"Author": "Leo Damian", "Date": "March 7, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> This app is a failure. Too bad. Such great hardware, but this app should be scraped and an intuitive well designed app should be built."}
{"Author": "", "Date": "July 19, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\"></span> This is a great app. Insteon may take a little work to set up but when you do it is great. Works flawlessly with Echo. Just follow the instructions exactly. I have set up several houses most with 40 plus devices."}
{"Author": "Michael Babcock", "Date": "March 30, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\"></span> It works, usually, but it's so slow and ugly and not at all intuitive."}
{"Author": "Patrick Perkins", "Date": "April 20, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> I would think an app this poorly implemented would be an embarrasment to a company as mature as Insteon.  Apparently NOT"}
{"Author": "Bruce Hellmich", "Date": "March 3, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Setting up a system is clunky and lacks a lot of features.  This app. needs considerable work to make it user friendly."}
{"Author": "Pres W", "Date": "July 25, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> I agree with so many others. What a crappy app. I started it (after plugging the hub into my router), was invited to set up an account, then to add a device I was prompted to enter a user name and password. Nowhere was it clear that I wasn't entering the username I had just set up. No, apparently there is a sticker on the hub that had it's own name and password. By the way, the app has a \"scan QR code\" option, that doesn't work. So I manually enter the name and password on the hub. Then the app tells me it's looking for firmware update (no choice), which it never finishes. Restarting it, I see choices of devices to add. I have one: a wired dimmer. Press and hold the setup button, then have the app look for devices... You guessed it, searches forever. Go through the \"manual add\" procedure. Can't find it. Terrible start. Probably retuning all this Insteon junk to Amazon."}
{"Author": "", "Date": "March 8, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\"></span> You screwed up the start of DST again. It doesn't start until March 12th."}
{"Author": "Thomas Anthony", "Date": "February 20, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Great system.. I have own for years..i also wish that scene modes could have a time schedule within that."}
{"Author": "", "Date": "April 2, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Battery hog and no substantial update in a long time.   Poor UI/UX, especially for cameras."}
{"Author": "Christopher Turpin", "Date": "April 12, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Never logged in.  Most of the time it takes longer to sync then its worth waiting.  Just get up and turn on or adjust manually."}
{"Author": "Wei Wang", "Date": "March 7, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> All the app does is telling me it fails to create my account!"}
{"Author": "Ryan Senio", "Date": "July 6, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Constant connection to the hub has been lost."}
{"Author": "Vidit Agarwal", "Date": "July 20, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\"></span> What the heck is wrong with you people. Freaking update the app!!"}
{"Author": "", "Date": "June 19, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\"></span> I've used this app for about 6 months and never had any issues.  I control lights and thermostat on a house from another state and it works great."}
{"Author": "Jason Fortier", "Date": "June 2, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\"></span> A year a go you said to be working on full screen view for cameras??  What's the deal. This should not be that hard"}
{"Author": "Leon Newhall", "Date": "June 20, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Not enough control please update your app other apps are better for your product that's sad"}
{"Author": "Joel Wener", "Date": "April 7, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Lacks features, cannot set default on levels, ramp rates, buggy.  A little bit slow..."}
{"Author": "Matthew Boswell", "Date": "June 22, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> When the app loses connection to base its way too noisy about reconnecting."}
{"Author": "Ronny Katzenberger", "Date": "April 27, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\"></span> until the android app finally adds support for the Insteon Mini Remote, this is a 1 star app for me."}
{"Author": "Robert K", "Date": "March 30, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> The schedule for the scenes does not work."}
{"Author": "Dennis Phillips", "Date": "February 25, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Great product. Does almost everything I need and 3rd party apps help with the rest."}
{"Author": "Randy Stidwell", "Date": "July 24, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> This app will totally kill a Pixel"}
{"Author": "Geno Bambino", "Date": "March 12, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Frequently freezes up or crashes. Worst. App. Interface. Ever."}
{"Author": "Brian Bechan", "Date": "March 22, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Insteon, making automation great again!"}
{"Author": "Nordine Sulaiman", "Date": "March 29, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Do not allow me to create  account"}
{"Author": "Nichel James", "Date": "May 5, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Pay more attention to Android!"}
{"Author": "Nicholas Capaldo", "Date": "March 31, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Works 25% of the time."}
{"Author": "Jesse smith", "Date": "April 12, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Mobile App sucks"}
{"Author": "Raymond Lee", "Date": "June 28, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Does not auto connect when internet is lost and reconnected."}
{"Author": "Paul O'Brien", "Date": "July 28, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Hire a designer"}
{"Author": "Brian Moser", "Date": "February 24, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Won't even start now"}
{"Author": "Eugene Peter Wittkoff", "Date": "January 14, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">App works best with Dual Band WiFi at 5ghz</span> Upgraded WiFi router to DB with 5ghz.  5ghz (newer Android only) and app devices except cameras work from external. Port fwd for cameras stopped working... a Verizon cable service issue. Have enough sensors around my home to relay well. Android app at times times won't  show cameras when home without restart. Variety of sensors for cheap makes it worthwhile buying the Insteon kit.  Helps secure my house. HUB must be on its own outlet!  Latest app version more stable and IP cameras work now. Alexa great!"}
{"Author": "Vish Talreja", "Date": "December 28, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Gosh - just hire a designer for 10 hours</span> Flagship product with an app that's looks like an afterthought should be embarrassing for the product managers. I would be embarrassed on my resume to say I built this app for Insteon. Just hire a designer and rebuild the app - or message me and I'll design you one. I have a ton of Insteon devices at home and just absolutely hate the look and UX of this app. Also a mega embarrassment to recommend Insteon to friends. They might throw up after looking at the app."}
{"Author": "Steven Johnson", "Date": "January 25, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Worst app ever.  Some how it let me skip setting up the hub the right way.  Now it will not let me go any further. Stuck at failed to connect.  Could fix this if I caould delete my account.  By can't get into my accout with the app because it wants to find the hub.    Stuck and don't want to wait on customer service.  But looks like I will."}
{"Author": "Ryan Raney", "Date": "January 20, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Just won the starter kit with two dimmers at a company raffle. Got home to set it up and the app crashed during the process. Now I can't log into the app because it can't see the hub. I never even got to finish pairing it with the hub. The support section I. The website does not mention what to do in this situation at all so now I'm stuck with a hub I can't connect to. At least I didnt pay for it I guess."}
{"Author": "Cory Drews", "Date": "January 12, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">You can do better than this!!</span> Android app is almost unusable.  Started out fine but as I added more Insteon devises it is now so unstable that nothing works.  Apple devises work fine but as an Android user I refuse to change phones just to have this all work.  Oh well spent a few hundred dollars on Insteon products that will all be going back to Amazon.  Seems Insteon doesn't need the additional revenue from Android users...must be nice!"}
{"Author": "Terry McCoy", "Date": "February 10, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Who designed this app? Please fire that person so they can go find a job they are actually good at! This is a terrible, terrible, terrible app. I truly regret having invested so deeply into the Insteon ecosystem when they clearly do not have that level of commitment themselves. Shame on you Insteon :-("}
{"Author": "Hamish Barrett", "Date": "February 8, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\"></span> The app works ok. There is no way to reorder the icons so that most used devices can be set in a more convenient way. There is no way to view a camera and turn on a switch and see it work. One has to change from the camera to the switch and then back to the camera to see if the command was executed. A split screen view would solve this issue."}
{"Author": "Chanpreet Matharu", "Date": "December 30, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Good to see...Developers are working on it</span> Been using the insteon from two year..the first year was a disappointment, hence the bad review. But insteon handled it good.. replied to my feedback, fixed the problem I was having and constantly working on the software to improve...Good to see regular updates,"}
{"Author": "", "Date": "December 27, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">For previous versions</span> Last update causes error \"failed verification\".  Can no  longer log in or control my devices.  It used to work great until the last upate, that  is why  gave it a 5 star rating.  Anyone can make a mistake and the programmer made a big one this time.  Please hurry and fix it.           UPDATE!!   Wow that was fast!!!! Apparatly the update fix was available even before I finished my review.  Works great now, THANK YOU!"}
{"Author": "Mike's World", "Date": "February 11, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Absolutely the worst app I've ever installed.    For some reason, while on vacation and driving across country, and while the Google Map app was running on my phone's screen, and while this Insteon app was not even displayed on the screen, it managed to somehow use almost 6 GB of my 4G Verizon cellular data.  WHY? Why would this Insteon app use 6 GB of cellular data while not even being used?    I really really dislike Insteon now. It did it once more and used 2 GB more data before I caught it and killed the app in Android Setup.  It's a huge risk to even have this app loaded on my phone now.  What was it doing? What is it going?  I'm a little .. upset.  Going to switch to Honeywell."}
{"Author": "Josh Hubbard", "Date": "February 14, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\"></span> It's been awhile since I've updated my review and a lot of updates to the app and hub firmware as well. The Android app now works consistently, and I've had nearly no problems in the last few months with adding, removing, renaming or creating scenes like in the past. I hope they add ifft support soon, and simplify the weird interface.  It has come a long ways from what it was."}
{"Author": "John Smith", "Date": "January 24, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> I stopped using this app and downloaded Homeboy for Insteon , much better app. With this app i am constantly having to log back in because the app doesn't remember me. That is a pain for a service that is supposed to make things more convenient and easy to use."}
{"Author": "Jason G", "Date": "December 28, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Don't waste your money on Insteon</span> Close to $1000 in equipment, and 100s of hours put into trying to get this system set up right and it still gives me headaches every day. The Insteon for Hub app itself has hardly changed since it's first debut despite numerous obvious shortcomings. At this point I am using Logitech's Harmony system to control my hub because they managed to create a better interface in a matter of months than Insteon has in several years..i swear, there can't be more than 2 people on their development team."}
{"Author": "Demo Account", "Date": "January 12, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Amatures</span> Great product but Android app is brutal at best.  Occasionally works but I/O switch monitoring sucks as does dual thermostat.  Take my advise and use only with apple products (pains me as I'm an apple hater).  When friends come over and connect with their various Apple products everything works flawlessly...Argh!!!!!"}
{"Author": "Bryan Drake", "Date": "December 28, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Newest update broke my login</span> Thank you VERY much for the immediate response! Working great again! I always love to see updates to Insteon and look forward to getting more sensors. Keep up the great work!"}
{"Author": "Mike Prano", "Date": "February 5, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Worked great,now i installed  hd cameras it wont let me see them all the time. I have to reset the app not happy spent alot of money and like the app to work. PLEASE HELP AND FIX"}
{"Author": "", "Date": "January 18, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> There's no way provided to replace a failed hub. No way to transfer my many devices, timers etc. There's got to be a better way. Awfully disappointed in the entire Insteon system."}
{"Author": "Patrick Cedrowski", "Date": "December 27, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">UI needs work</span> User interface needs serious work: overall navigation is confusing, lack of a home screen, back stack is non standard, etc. Feels like an app from early 2000's."}
{"Author": "Jeff Whitehead", "Date": "February 15, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Considering the reviews and responses that there is a backend issue preventing new users from connecting since at least 2/6, that tells me Insteon isnt concerned about fixing their issues. Any other company would have fired every management person involved in not fixing this issue quickly. I too am plagued by the inability to login to my new hub. Insteon you need to fix the issue and not require new installations to call your support line."}
{"Author": "", "Date": "January 21, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\"></span> ANDROID APP NEEDS SOME TWEAKING  I have a small fortune invested in numerous Insteon switches, outlets, cameras, hubs etc. I have two homes and Insteon works 99% of the time with no issues under my IOS or Windows platforms. The Android platform does not allow me to switch from one home to the other within the app the way my Apple app and Windows app does. Can your tech department fix this issue with an update or is there some sort of trick to make this work for Android. Get it working properly and I will come back and give you a 100% favorable rating"}
{"Author": "Meredith Rouse", "Date": "January 18, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Bought this over two weeks ago returning it now. Won't connect to Hub . called the company 5 days ago sat on hold for an hour somebody picked up and then hung up sat on hold another hour and then was told they were updating the app and to try again and if it doesn't work to call back on Tuesday. Today is Wednesday have been on hold an hour and 5 minutes no one ever answered have install the app and put it back on. unplugged it, tried it on different phones and tablets nothing will connect to the hub. Unfortunately this products a piece of junk and awful customer service. I also emailed them 2 days ago with no response."}
{"Author": "Chuck K", "Date": "February 15, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Been doing lighting controls for over 12 years and electronics for 30. This system is frustrating and extremely time consuming if you have a windows based or Android ios, phone or pad, it is EXTREMELY unreliable. Sometimes it took the program, sometimes it didn't. As a professional, I will tell 2 big builders tomorrow that I will decline to install this. Also, 2 days in a row, I was on hold for over 1 hour and a half twice for support before I hung up. I emailed and got a responce 2 days later.  This is not a professional product.  Good luck"}
{"Author": "Mike Butash", "Date": "December 31, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Smarthome fails at making basic modems that can last more than 2 years and not die, and trying these hubs, found that their software is so dysfunctional they are of absolutely no use.  The app just crashes when I attempt to add a basic dimmer device.  So frustrating!  I really need to just bite the bullet and replace these insteon devices with zwave, though none are as pretty, perhaps they actually have some level of support being not hinged on one single crappy company.  Thanks for all the fish, Smarthome."}
{"Author": "t casulli", "Date": "January 9, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Doesn't recognize the hub</span> Was excited about reviving this gift. Total fail. It doesn't even recognize the hub when I try to configure.  Waste of 2 hours."}
{"Author": "Adam Krumm", "Date": "January 22, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\"></span> If your having problems  with your Hub call them apparently the app is not compatible old firmware. They had to Update my Hub in order for it to work"}
{"Author": "", "Date": "December 28, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Had a hick up - but it's fixed</span> Insteon released wrong software version to users. Within an hour, they had it fixed. Thanks for speedy recovery."}
{"Author": "Kevin Burrell", "Date": "February 5, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> It will not connect to the hub. Which makes it virtually useless. It was connected at one time. However that only lasted a year."}
{"Author": "H Durham police take down", "Date": "February 7, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Hub has green light but app is failing to connect. Luckily It's not too late to return! If it  doesn't work out of the box who knows what other issues await. Sucks because I have to pay electrician again to replace wall switches."}
{"Author": "Raymond Cauchon", "Date": "December 29, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Well but costly</span> I like the product very much it works well but it is very pricey for such simple components but I'm still very happy with it but I just can't upgrade it very often because of the prices I would be much more if the prices were better than Valium would be much more for the company butt so big I'm still happy"}
{"Author": "Corina", "Date": "February 3, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> I regret investing in insteon, not because it's a bad product, but rather they just don't understand or care how important the app is. I've been waiting for years and years for them to get on the ball but I'm beginning to think that won't happen. When an app won't allow me to answer an important incoming call....it's time to leave a review that reflects my experience."}
{"Author": "Jessica Berg", "Date": "January 7, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Please fix volume glitch</span> Whenever you try to adjust the volume on a camera, it immediately kicks you out of the app to the login screen. Does it from all of our Android devices. So annoying. Please fix this."}
{"Author": "Scott Warfield", "Date": "December 28, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Still waiting</span> For an interference updated to modern standards. And get rid of the stupid dial on the thermostat!"}
{"Author": "Lance Marks", "Date": "January 18, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Bought 4 Starter kits,  opened first tried to setup \"Failed to Connect to Hub\"  opened second \"Failed to Connect to Hub\".  Wife is watching Netflix and I have Internet to write this review of how terrible this product is and the application is no where near 2016 flagship product.  I will be returning all 4 starter kits tomorrow and going to Z-Wave products."}
{"Author": "C YP", "Date": "January 16, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">AMONG MY WORST PURCHASES EVER</span> IT never connected to hub during set up. I was on hold for 75 minutes with phone support. Support couldnt fix it. Told me to wait a week and cross my fingers that techs would figure it out. I'm supposed to let this thing sit for one week not being used after I spent my hard earned money on it. Outrageous. I will return it now."}
{"Author": "Jesse Anderson", "Date": "December 27, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Problems... Problems and more problems</span> Apple app will not connect to Hub. Android app will not connect. hub has connection via my modem, and insteon server..... most people seem to be forced into a private separately owned Homeboy app that manages this crap better. Throughly exhausted every once of interest in this crap of a product. returning hub, dimmer switches, fan controllers and water sensors as soon as i possibly can....... STAY AWAY."}
{"Author": "Mike Venable", "Date": "January 14, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Won't even set up and service is... Non existent</span> Just received the assurance kit and setting up the hub... But phone won't connect to it. Follow online troubleshooting and... Still nothing. Try calling their service and.... Still on hold 45 minutes later with no sign of help. Returning product and giving up on Insteon. I have several other home automation products connected to my echos, all were a breeze to set up. I'm very technical, so when something just doesn't work after spending time trying to figure out the problem... It's just not worth it."}
{"Author": "Anthony Rietveld", "Date": "February 5, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Improving but still very outdated. Please update. Need to push more products into the Australian. Does  not work with Nougat.."}
{"Author": "Kevin Becker", "Date": "January 5, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Poor design</span> Lots of problems here. It doesn't remember settings so when a device is displayed that's when it attempts to get data, which takes several seconds."}
{"Author": "Jas Mcc", "Date": "December 27, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Was broke, now fixed</span> It might even be faster to load. Good job guys."}
{"Author": "S O", "Date": "February 19, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Worst app I've ever used. Extremely unreliable and I'm constantly calling tech support to set up new devices. Returning all of my insteon products and switching to lutron"}
{"Author": "Mark Cobb", "Date": "February 17, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> 2nd attempt at install app will not communicate with insteon and find hub. To add to it tech support wait is annoyingly long. Email takes days very dissapointed."}
{"Author": "Sue Byers", "Date": "February 1, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> I have tried to set up my account and have been unable to... very disappointed,  Everything seems to work except the last step - frustrated and tired of trying!"}
{"Author": "david balingit", "Date": "January 8, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Buggy</span> The app won't work for more than a few minutes before losing all communication with modules. Have to hard shutdown the app to get it all talking again."}
{"Author": "Dan Dumont", "Date": "January 31, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> If you can't design a decent app, at least approve my API account so I can try."}
{"Author": "Rich Penman", "Date": "January 10, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Android app sucks</span> The IOS app is much better and actually works unlike the half-assed attempt on the android platform. Get your act together."}
{"Author": "Dan Berg", "Date": "January 2, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Can't login</span> Latest version gives me an authentication error and won't even allow me to login."}
{"Author": "Michael Kenny", "Date": "December 27, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Works as expected</span> Not a great looking app but it works."}
{"Author": "Pete Shines", "Date": "January 12, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> From the worst apps I've seen"}
{"Author": "Michelle Able", "Date": "February 8, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Was on hold for over an hour with customer service and they never answered!!!! Do not buy from this company!!!"}
{"Author": "Gerald Portee", "Date": "February 18, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Problems getting hub working, can't  delete  account"}
{"Author": "Joey Brakefield", "Date": "February 8, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Horrible interface. Clunky controls. Doesn't remember login information."}
{"Author": "R Vass", "Date": "December 27, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Your update caused a lot of confusion and couldnt work any longer. What can i do??????"}
{"Author": "Kathy Terry", "Date": "January 14, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Cannot get it to work</span> Truly should not be this hard to get this item to work"}
{"Author": "Rob Stroud", "Date": "February 8, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Does not work! Hub is useless."}
{"Author": "Weston Spaustat", "Date": "December 28, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Thank you for the quick response.  Working fine now."}
{"Author": "", "Date": "December 27, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Update fixed</span> New update fixed issues"}
{"Author": "", "Date": "February 1, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Could be excellent with small improvements like multi hub ability and better stability. Only works 50% of the time."}
{"Author": "Walter Larson", "Date": "December 28, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Works great</span> I use it along with Alexa for lighting control and have not had any problems."}
{"Author": "Roman Gluhov", "Date": "January 10, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Seem to get better!</span> Application is seems getting better. Glad that company trying to keep it updated!"}
{"Author": "H. Moose", "Date": "December 27, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\"></span> New update of 12/27/16 now again works with Android. Thanks!"}
{"Author": "Eric Lizotte", "Date": "December 27, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">You fixed it</span> App works like a charm"}
{"Author": "Mike Lethco", "Date": "January 10, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Can't get it to do voice commands for x10 through echo or make a scene including x10"}
{"Author": "Paul Wheatcraft", "Date": "January 23, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Scenes are limited. Not enough icons"}
{"Author": "Diane Conley", "Date": "January 8, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Not working</span> Ugh"}
{"Author": "Tan WenJie", "Date": "February 6, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Can't connect to hub at all"}
{"Author": "Paul Allen", "Date": "December 27, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Update: login issue fixed. App is stable. Works with Nest too."}
{"Author": "cor prs", "Date": "December 27, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">So far so good</span> Ok I'm back on"}
{"Author": "gus stamoulis", "Date": "January 30, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Support sucks"}
{"Author": "Matthew Nezbeda", "Date": "December 27, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Would love Widget Support</span> I've found myself hunting for the app, waiting for it to open, then pressing the same one or two devices frequently. It would be great if there could be a toggle button for single devices on the home screens so I can simply place it in an easy access area to single tap turn on lights or toggle garage.  IFTTT support would be great as well."}
{"Author": "Rik Taylor", "Date": "December 27, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">No Longer able to log in</span> Since updating I can't even login. Fails authentication right away. This app has always been kinda garbage, but now it is complete garbage. This is a great way to get me to buy a different home automation hardware. At least Smart Things has software that works. This is pretty much the end for me and Insteon. I will just eat the few hundred dollars I spent and move on. Anyone looking for an Insteon hub? Selling dirt cheap."}
{"Author": "Jeff Olszewski", "Date": "December 27, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Currently broken on Android</span> After the latest update I cannot authenticate on any Android device. OMG, will you guys please hire some good developers to fix this software."}
{"Author": "", "Date": "December 27, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> NG after last update can not sign in what a joke bad programmers"}
{"Author": "Ryan Hagemaster", "Date": "December 27, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Update killed it</span> This update makes it not work great update winning Uninstall go download from amazon it's not updated"}
{"Author": "Eric Wilcox", "Date": "December 27, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Junk</span> After last update app is 100% useless. Have Uninstalled and now using a 3rd party app."}
{"Author": "James Maffucci", "Date": "December 27, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Can't log in</span> I updated my app today and now I cannot log in on my android devices.  I phone is working OK.  Please fix this."}
{"Author": "Grant Bishop", "Date": "November 26, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">What's up with this?</span> Updated to the latest hub in order use it with the Amazon Echo. Now the app doesn't update screen icons and I have to close out the program and reopen it constantly in order for it to work at all. This app is installed on a Nexus 9 running the latest Android OS and on Droid Turbo running Android 5.1. Both exhibit the same issues. Update: After doing a factory reset on all of my devices and rebuilding my entire setup the app is performing better."}
{"Author": "Cody Smith", "Date": "December 10, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Terrible Updates</span> After update, I cannot even use this app on my Droid devices  Tries to login, but then immediately logs out and takes the login screen back to the start point. Totally unusable. Using a note 4 phone, and a Galaxy tablet A tablet.  Apple devices work fine."}
{"Author": "ChristO", "Date": "December 10, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Will not launch on Android 6.0.1</span> I gave a Samsung S7 and the app won't launch at all. The entire insteon architecture becomes somewhat useless if I can't control and integrate.  I really hope Insteon gets it together fast. Won't add to system till resolved."}
{"Author": "Andrew Major", "Date": "December 1, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Does not Work on OnePlus with Marshmallow</span> This app did not work at all on my One plus One phone with Marshmallow.  Crashes on the login screen.  Not the first time this year that an update rendered the app useless  on my phone. Luckily I have an iPad for backup whenever the android app fails due to updates."}
{"Author": "Victor P", "Date": "November 24, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Don't Buy!! Return to retail store ASAP</span> Get yourself a SmartThings hub or Hue instead. Insteon doesn't care about Android. All development efforts go to iOS. 2 years of waiting n still same olé laggy, buggy, outdated app. Still waiting for widgets, G Wear, G TV, IFFTT and now Google Home support. The latter should be a no brainer. Example: Wear was released a whole year b4 the Iwatch. But when the Iwatch was released it already had support baked into the Insteon iOS app. For us \"just use Tasker\"... Unacceptable!!! Worst investment I've EVER made."}
{"Author": "David Jourden", "Date": "December 1, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Won't authenticate</span> Can't login with latest version on Samsung Galaxy Tab A 8\" or Galaxy Tab 4 - just goes back to login screen over and over and then crashes. If I purposely put a wrong password in, it instead says Authentication failed. Now I own a collection of expensive paperweights."}
{"Author": "Eddy Visser", "Date": "November 25, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Status icons of Check-in devices are broken.  The newest version (1.9.4. -223)  did not fixed this issue.  There is no change during open or close and at motion. Not one of all the devices send a message. Please update as soon as possible, with version 1.9.2 - 220 everthing works fine."}
{"Author": "Joseph Spagnuolo", "Date": "November 28, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Very convoluted</span> Devices, rooms, scenes. The differentiation between these \"types\" get very muddy very quickly. Mixture of insteon and legacy X10 devices are hard to manage. Scheduling separate devices or scenes to come on or go off at the exact same time is not possible. Three separate devices or scenes cannot all be scheduled to turn on at 5:30pm and off at 12am. They're separate scenes because I want to be able to turn them on manually separately. Why can't I set them to be scheduled to turn on/off at the same time?"}
{"Author": "", "Date": "November 30, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Great but support lacking for older devices</span> I really enjoy this app. Insteon has come a long way since I bought in near the beginning. The problem is the lack of support for older Insteon established devices. IRLinc, RemoteLinc, mini-Remote... Oh and of course the non-standard look, feel and operation of the app itself. Oh and what about about guest account access?! Please add more developers and polish this off!"}
{"Author": "Dave Lloyd", "Date": "February 17, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Ok for really basic configs, but can't create any basic 'if' conditions.  Eg, if I manually selected \"movie\" scene then ignore the 7pm scheduled \"evening\" scene. Don't even think about more complex ideas such as..if door open and daylight is dark (from motion sensor unit) switch on lights but don't switch them off again when door closes."}
{"Author": "", "Date": "November 27, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Still no heartbeat</span> I bought 30 Leak Sensors and have been calling tech support for 2 months. Was told it would be addressed in next update but no fix. I pull the battery from any sensor and leave it out for days and the app still says status is dry. No notification or change in status to indicate low/no battery or no communication. They're advertised to have a heartbeat every 24 hrs but they don't. They are for piece of mind but its pointless if you can't rely on them to tell you if battery is dead or no communication."}
{"Author": "Thomas Dorsch", "Date": "November 28, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Easy to set up and use.</span> I don't know why there are so many negative reviews. I did some homework and found out which system is best for me. Insteon may be a good choice for Android users. It works directly with NEST equipment, (owned by Google) so if you are following the Google trend this may be a good way to go. I hooked up the hub to my WiFi router. Installed the app. Identified my modules, labeled my sites and had wireless control of lights, etc in less than an hour. If you can read and follow directions, it should go well."}
{"Author": "Andy Kaiser", "Date": "December 28, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Does what you need it to do</span> As you can see by all the other ratings here, the app's not going to win any awards. But the Insteon network's ability to run lights and outlets on timers and manage them remotely from your phone gets the job done reliably, and that's good enough for me. If they make things easier to use, I certainly won't complain, but I'm definitely a very satisfied customer."}
{"Author": "Sean Reneau", "Date": "December 5, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">App update not working</span> I am not able to logon with the updated Android version of the app.  I had no issues previously."}
{"Author": "Corican Yu", "Date": "December 10, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Poor app losts connection every 10 minutes</span> It used to be OK. However, after I switched my phone to Google Pixel, which is Android Nougat, the app started to constantly drop connection. Everytime I'd like to use it I have to wait for 10 sec to let the app reconnect itself to the hub, in which time I would have turned on the switch by hand. So inconvenience! Insteon device is good but the app is definitely poor. And remember it almost compatible with NO other smart devices. I'm replacing my insteon with Smartthings or Wink Hub."}
{"Author": "Jeff Kuhlmeier", "Date": "November 28, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Incredibly out of date</span> The posted images don't represent the real app, and it's way behind the iOS version."}
{"Author": "Mark K", "Date": "December 22, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Dangerous App.</span> This app opens sets of 3 UPnP ports on my wifi router. After a while another set is opened without closing the previous one. This continues until so many ports are opened that other UPnP applications such as IP cameras stop working. This is substandard from any data security point of view. Please fix this problem before it becomes a legal matter."}
{"Author": "Brad Nagel", "Date": "November 24, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Status icons of devices are broken/missing. Edit: Newest version fixed this issue. Still waiting for all the features promised for some time now."}
{"Author": "Rabbit", "Date": "December 13, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Time zone issues and crashes</span> When trying to set the correct time zone on the map, the app crashes.  Hub believes that my time zone is GMT and not est."}
{"Author": "Alyssa McGinnis", "Date": "December 5, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Worst ever</span> I have a whole house full of insteon products but their app really sucks. So controlling them is terrible. My cameras never connect the app never loads so frustrating."}
{"Author": "Dwight Smith", "Date": "December 14, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Needs some work. Has many missing features that are available in the older Windows version, HouseLinc. Frustrating that Insteon has abandoned the Windows platform as it was maturing nicely. Not everyone wants JUST a Smartphone interface. And if they did we must have those features. I have a couple dozen devices, yet only 9 show up on \"All Devices\" page! What??  Similar looking pages are confusing, hard to figure out which page you were on to do that \"thing\" you just did 10 minutes ago. Android &amp; it's dozens of flavors from numerous cell phone providers, causes no end of frustrations due to inconsistent &amp; incompatible platforms. What a nightmare for developers &amp; users alike! Hellooooo......... Insteon, are you listening?"}
{"Author": "Mike Alto", "Date": "November 24, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\"></span> It's been fixed with 1.9.4  INSTEON ARE YOU LOOKING FOR A GOOD QA PERSON ?1.9.3  has broken status indicators for my LG phone and a Samsung tablet. how do I revert back to 1.9.2???"}
{"Author": "Brian Dossett", "Date": "November 24, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Guest loggin...</span> Finally updating Android more frequently. Device status is working fine again. Would love to see a guest loggin in on the app."}
{"Author": "M", "Date": "January 1, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Keeps logging me off</span> This app keeps logging me off.  It's already an annoyance to have to pull out your phone to turn the lights off,  it's even worse when you have to type a username and a password all the time."}
{"Author": "Kenneth Hamaker", "Date": "November 29, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">It does better than most</span> I have installed two other security devices and have a had more problems with them than with Insteon."}
{"Author": "Andrew Jones", "Date": "December 1, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Complete garbage</span> Not only is the design terrible, but most of the time it doesn't even work."}
{"Author": "leah boardley", "Date": "December 3, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Try to use a camera all it does is spin.</span> Doesn't work well with samsung note 4"}
{"Author": "Mark Lewis", "Date": "December 17, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Can't Authenticate - Pixel XL</span> All of my iOS devices continue to authenticate, but Insteon will not authenticate on Android device (Pixel XL). Oddly enough, I can get Homeboy app to authenticate on my Pixel, but I'd prefer to use the Insteon app. What is up?"}
{"Author": "Matthew Baker", "Date": "December 1, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Schedules not working</span> Brand new hub, 'House' section gets stuck \"reading config\""}
{"Author": "Troy Stephens", "Date": "December 13, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Not bad, but...</span> Why can't I go full screen with the camera view on my mobile dvice and why doesn't the screen rotate with my device?"}
{"Author": "", "Date": "December 2, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Cant log in</span> I cant log in with my samsung s7 edge after last update please help"}
{"Author": "Ray Elmore", "Date": "December 28, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Just testing the concept</span> good concept, but slow updates and poor U/I contribute to a poor experience."}
{"Author": "Mustafa Kapasi", "Date": "November 24, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Does what it's supposed to</span> Great for controlling lights. Pretty limited otherwise"}
{"Author": "Brooke Peña", "Date": "November 25, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Hate it</span> App outdated"}
{"Author": "Barry Woods", "Date": "February 1, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Keeps force closing."}
{"Author": "Shaun Blair", "Date": "December 20, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Will not install"}
{"Author": "Wesley Brumbaugh", "Date": "December 14, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Thermostat</span> Would like to see schedule editing for thermostat."}
{"Author": "2440JOKS", "Date": "December 30, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Nice"}
{"Author": "Manoj George", "Date": "October 23, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Terrible product. Did not find hub</span> Tried on 2 different houses. Could not find the hub. Bought in clearance...now I understand why. Store also informed me that more than 40% were returned back because of performance issues."}
{"Author": "Jerrod Kogut", "Date": "November 22, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Needs more work and Android Wear support</span> I can't program my mini remotes.  Needs widgets, and Android Wear support.   The app is fairly responsive (some of the time),  but it needs more customization options and bug fixes.  I'm happy to give details if requested.  Needs integration with HouseLinc software settings.  When hitting the back button at the root it should exit app, not logout the user.  IFTTT please!"}
{"Author": "Dalbir Taggar", "Date": "October 15, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Latest update 1.9.2</span> Camera screen does not support pan tilt action. Earlier it had four arrows now its missing. No touch action works."}
{"Author": "Joe Prebish", "Date": "November 27, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Great system</span> Easy and Simple home control. Need better and more attentive help."}
{"Author": "Leo P", "Date": "August 26, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Nice app but does not share scenes</span> Whe you setup a dimmer on your phone it also shows up on your tablet.  Not so for scenes.  You have to set those up on each device separately."}
{"Author": "Steve Gould", "Date": "November 3, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Worst</span> Frustrating. Dysfunctional. No support."}
{"Author": "Bobby Norvell", "Date": "October 17, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Need landscspe mode</span> Why not support landscape mode like you do on Mac products. This is a must add"}
{"Author": "Lloyd Mosley", "Date": "October 11, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">App needs work</span> Far too outdated and missing features that have been available on the iPhone side for a while."}
{"Author": "Rob Ocovich", "Date": "November 22, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Update the interface!</span> I love my insteon products but this app is sooooo old looking! Time to get a little more competitive Insteon."}
{"Author": "drpuffypants", "Date": "September 10, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> The latest version of the app makes it impossible to remove devices from scenes. It says the devices removed successfully, but they still respond to scene triggers.   I had this same problem since November 30, 2014 and it was fixed on July 11, 2016. In the August 22, 2016 version update it broke the fix and I am experiencing this issue again.  I have invested $1,300 into this system and I would suggest that anyone considering this product please consider a different smarthome system. Their developers simply do not put any attention into creating a consistent application experience. I could not dream of developing an application as sub-par as this. However, on a positive note the UX on the application is very great, probably the best in the smarthome business."}
{"Author": "Geoffrey L.", "Date": "November 21, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">.. Mixed</span> Good; insteon fixed issues with previous hardware.. syncing, signal strenght.. Bad; App is clumsy and needs overall.."}
{"Author": "Mitch Le", "Date": "November 2, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Returning</span> It doesn't work! Will be returning it to Costco."}
{"Author": "John Terwiel", "Date": "October 23, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Problems</span> Constantly doesn't work. I have to reset Internet modem and hub and phone and sometimes that doesn't even work. Then its turn everything off manually. Pain in the butt."}
{"Author": "John S", "Date": "November 18, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Update November 2016</span> Installed the app on both my Galaxy S4 and my Galaxy tablet. The app incorrectly displays sunrise/sunset times on both devices. It is one hour off, later. I turned on DST, no change. The Windows 10 app, correctly displays the time. There doesn't appear any way to fix this, even moving my location to another time zone and back again doesn't fix it. ** I entered this review in January. 10 months later, another time change and nothing is fixed. Does anyone ever read these reviews? Very frustrating!"}
{"Author": "Akira Yamanita", "Date": "August 25, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Unable to toggle DST</span> The setting works fine in the iOS app. Also, this isn't app specific but I would really appreciate the ability to set an offset for sunrise and sunset."}
{"Author": "aldo bylyku", "Date": "October 16, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Desperately needs a UI face-lift and connectivity update!!!</span> The app has had the same spartan interface for years. There is so much more capable than what the app allows. Please update!!!"}
{"Author": "Nistar Auhaan", "Date": "December 6, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Dumb app</span> This app is a bullshit."}
{"Author": "", "Date": "November 22, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">When you support your lock controllers?</span> When adding a lock controller it display as an on/off switch. And then it never unlocks the door, only locks. Works fine when pressing the button on the lock controller but I can't do that if I'm locked outside the house!"}
{"Author": "Athol Cohen", "Date": "August 26, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Insteon App crashes constantly</span> Quite stable on OnePlus Two running Oxygen but the time if still an ongoing issue.  If I set the time on my iPad it's correct but about 20 minutes off on the Android app."}
{"Author": "Doug Vinie", "Date": "August 27, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Camera view and size</span> Size of camera view is stuck in 1982.  On a note 3 which has a big screen.  Open up my insteon app and camera view only works in portait mode and only fills 30 percent of screen.  Why not allow full screen portrait or landacape. Never seen anything like it."}
{"Author": "Jonathan Iavarone", "Date": "September 2, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Android wear</span> Camera does not load AT ALL. This is getting old really. This needs to be updated AND support android wear!!! Its ridiculous that it still doesn't."}
{"Author": "Jason Dessenberg", "Date": "November 18, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Layout Poorly Conceived</span> I don't have any connection problem or least nothing more than normal.  My issue is with the layout.  Why are iphone and Android apps so different?  The layout of the iPhone could be better but it is a whole lot better than the Android app.  I agree, the app needs a redesign.  Make the app across different devices the same."}
{"Author": "Tamara Smith", "Date": "October 28, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Happy house</span> We have the hub, 2 light plug in's 2 hard wire light switch ' s and a thermostat.   We love our Insteon home."}
{"Author": "Thomas Roach", "Date": "September 23, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Can I give 6 stars? Not the greatest (and the equipment is far from the priciest), but they keep working at improving the performance and features. Since this is not a stand-alone app but an operating interface for a home automation controller, I applaud their enthusiasm and dedication."}
{"Author": "Reverend Keseki", "Date": "August 22, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Dual Outlet Support Finally here!</span> Dual Outlet Support was seriously the main thing I wanted and now I have it. Thanks Insteon, I just hope you don't continue to put Android on the back burner."}
{"Author": "Jim Nosich", "Date": "October 23, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Insteon</span> Almost every time I use the app it locks up. Then I need to Uninstall and reinstall. That is a big pain"}
{"Author": "Andrey Lima", "Date": "November 10, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">No landscape mode on 1024x768 tablet</span> Terrible graphic design"}
{"Author": "Jim Sink", "Date": "September 7, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">The worst designed app I've used</span> Incredibly poor design. Setup and use is so inconvenient and illogical it's like they tried to make it awful. If only I didn't already have insteon devices. If you haven't purchased hardware yet, stay away from insteon."}
{"Author": "Cory Reina", "Date": "November 22, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Insteon,  The current release has broken THE MOST IMPORTANT FEATURE of the app, status indicators.  How in the world is one supposed to accurate status his/her Insteon site if the status indicators don't work?  How in the world can an app be released which has such a glaring bug?  It makes absolutely no sense.  The app is already inconveniently slow to use to get at status.  Now the user must either \"walk\" their actual site to status the various smart things, or individually go through them in the app, turning on each one in turn to get a status.  Very, very unprofessional!"}
{"Author": "Jason Schultz", "Date": "November 22, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Working but app could be better</span> Would be nice to be able to organize devices and scene in room or favorites. App needs to be stream lined and widgets would be nice."}
{"Author": "Weston Wakefield", "Date": "August 25, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Needs multihouse support since old and new hubs don't all support the same features.  Need old hub for sensors, new hubs for Harmony integration, etc...  Needs android wear support... needs iFTTT integration.  Slow connection to the hub over cloud when not connected in network or via VPN.  Needs to integration with IFTT so badly."}
{"Author": "Greg Brady", "Date": "November 20, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Where are the Widgets?</span> Widgets are a no brainer,  should have had them from the start.  Should work even if there is no internet connection.  Anytime my internet goes down so does my ability to use the app, even over a WiFi connection."}
{"Author": "Hugh Hemington", "Date": "November 10, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> First, the app won't hold the password.  It holds it ONCE on my phone, but never on any tablet I've tried it on.  Then the app gets worse from there.  It bears no resemblance to the Windows app, and it's anyone's guess why the Windows app is in STORE-- what a pain.  I tried to control my fan -- NOPE!  If I turn the fan off, the light goes on full.  Turn the light off and the fan goes to low."}
{"Author": "Deadly Judgment", "Date": "September 2, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Complete waste of time</span> App constantly tells me I'm not connect to the same network as the hub. Called customer service and that was complete waste itself cause they didn't help. Money wasted on the product and time wasted on trying to get the app working peoperly."}
{"Author": "Angelique Carter", "Date": "November 21, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">It's okay, but why can't I change the chime sound on my alert module?</span> It needs to be updated to work with the Alert Module.  I can easily add the module, but have no option to change the chime sound on a scene.  From what I understand the Apple app has this ability.  I also echo other reviews that the controls could be done in fewer steps."}
{"Author": "james yarbrough", "Date": "November 2, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Just bad waste of money</span> Better options out there .very clunky and outdated.barely worked for 5 minutes.threw it all in the trash."}
{"Author": "Dane Bignell", "Date": "November 23, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Updated app now doesn't show status of device</span> This app is junk, outdated and now doesn't work. Support is hopelessly slow with over a week to get even a response. Time to change products unfortunately.."}
{"Author": "Joost Zilla", "Date": "November 23, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Latest update broke status indicators</span> The app on it's own is already incredibly bad but with this feature missing it's even worse"}
{"Author": "David Grab", "Date": "November 17, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> This app is insanely annoying.  Every time I go to use it I have the message \"Connection lost - press ok\" even though my phone is connected all the time and definitely connected when I press ok  over and over and over again.    Each screen is different, nonstandard, and confusing in how you edit, add, and delete items. The screen titled \"rooms\" has icons for things that are not rooms (all, check-in, favorites) ... even though there are already icons for those items. The back arrow goes to the login screen... really? Every time I want to turn on a light I have to select the icon, and then another on/off icon ... really?      I chose Insteon because of its X10 support but I'm a disappointed that there is no feedback that X10 commands have been dispatched and you can't even use X10 modules in scenes. This app is rated below 3 star (and dropping).  Come on Insteon how do you expect to excel with an app like this? Update: when I got home last night my X10 modules would not respond.  So I tried an Insteon module and it would not respond either.  You would think that Insteon's touted mesh network would send you a message that the hub it not responding or automatically reboot the hub"}
{"Author": "Umar Sharif", "Date": "November 24, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Terrible</span> Dumbest smart home app, sign in and it disconnects, no supports,"}
{"Author": "Job Asiimwe", "Date": "July 22, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Please us more Camera Support on the App.   Right Now I have log in to the console to manage the camera setting."}
{"Author": "Digital Gadget", "Date": "July 8, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Finally app works again</span> Update: Finally working again after 9 months. Very concerning that the company would leave fatal errors in the code for so long, especially when there is no web access or other means of communication with Hub.  Luckily we have multiple platforms in our home and were able to use Windows 10 app to change programming."}
{"Author": "Michael Kipper", "Date": "June 16, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\"></span> I have no idea why the haters hate this app. It does everything I need it today: turn devices on, off, dim or bright. Turn scenes on and off. Create new devices and scenes. I also run the software on my iPad mini and a Windows 10 machine. Everything works great. I did freak out because I couldn't see all my devices but a call to Customer Services pointed out that they were on page 2 and 3. Duh!!"}
{"Author": "", "Date": "September 3, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Works fine</span> Only have switches and motion sensor, that combo works fine."}
{"Author": "Richard Davisson", "Date": "July 8, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Hardware fine, software needs work</span> Never had an issue with the hardware but the software really needs to be rebuilt.  Like to have a decent desktop app as well.  The one time I called support,  the guy was condescending - hopefully he was just having a bad day."}
{"Author": "Tony Pier", "Date": "November 1, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Easy Set-Up!</span> Right out of the box and on the walls! Worked great and now adding more!"}
{"Author": "Christian Hilty", "Date": "August 8, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Works well now"}
{"Author": "David Adams", "Date": "August 2, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Many flaws</span> Most notable is the fact that there is no exit button and using the back key will eventually log you out which forces you to log back in. Also updates are extremely slow, especially thermostats."}
{"Author": "David Williams", "Date": "June 28, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Major Investment AND Disapointment</span> Why offer full-screen landscape view on an iPhone and I'm stuck with a tiny camera view on my Android that doesn't rotate and is covered by giant arrows that do nothing for my outdoor Insteon camera because zoom and pan aren't features for this camera? These are fixable issues.  Please care enough to fix them!"}
{"Author": "zol starym", "Date": "August 23, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> The INSTEON controller is unstable"}
{"Author": "Nistar Auhaan", "Date": "December 6, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Dumb app</span> This app is a bullshit."}
{"Author": "Cristian Lira", "Date": "July 8, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Nice</span> Good experience"}
{"Author": "Karl Knoernschild", "Date": "October 29, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Battery killer, and seriously needs an update"}
{"Author": "Reichard Könige", "Date": "July 16, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Functional - Far Behind Everyone Else</span> Insteon hardware is solid. However their app and even the windows app is so far behind Samsung's Smartthings you're best off using that with zwave and zigbee. Yeah you'll have to plan your install carefully but once set you have a world of HA possibilities. So yes this app works and has improved but all you get is basic functionality. Even notification control is a joke. No home/away feature, no IFTTT integration, no (add expected feature here . You can add Insteon Devices, create scenes, that's about it..."}
{"Author": "Jeremy Arnold", "Date": "August 9, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">No time based alerts!</span> Hard for me to believe that for a door open/ close sensor you can not configure the alarm to only be active during certain times. This makes it totally useless"}
{"Author": "Chris Crutchfield", "Date": "June 15, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Needs overhaul</span> I've been dealing with issues since I bit on the insteon system. ANDROID PLATFORM APP IS TERRIBLE. The push notifications still don't work (even after the update) and the SMS notifications have never worked. Always have had issues connecting to multiple cameras when not on my home wi-fi. And the GUI is overall terrible. Too many steps to do simple things like dim lights. Also the system won't let you set up sequences for scenes. Always throws and error saying there is a conflict.  The competition is winning"}
{"Author": "Peter Chin", "Date": "July 22, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">I use the app all the time on my Samsung G6+</span> Love it."}
{"Author": "Randy Avery", "Date": "July 22, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Latest Revision Crashes Camera</span> After installing latest Revision 7/23/16 the camera now fails to work. App crashes and reboots, junk."}
{"Author": "Andrew Petriuusi", "Date": "August 14, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Dated interface, no full screen camera, not smart</span> Why is there no way to full screen cameras? Even Windows phone supported that... Add that to a horribly dated interface and poor \"smart\"interconnectedness and you get a system sorely under realizing it's potential. It is becoming clearer and clearer that Insteon is flash in the pan technology."}
{"Author": "A Joseph Ricci", "Date": "July 8, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Great system. More intuitive and visual software would be good.</span> I really like the functionality of the switches and dimmers.  The software works well but has relatively non visual and non intuitive interface esp where multiple devices linked.  Ability to link and unlink devices whether programmed by software or switch would be good.  Reports generator to create a switch by switch list of devices and settings would new great.  Replacement name plates expensive.   I found scraping off text with sharp blade and labeling with white Ptouch vinyl labels worked best."}
{"Author": "Devin Serpa", "Date": "July 8, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Getting better</span> Getting better as time goes on. Connection over mobile is working. Big problem: Won't connect, reset, or reregister as new hub after switching routers. Documentation said to delete account through Android app. This was impossible as the router went out. The old settings caused the app to display an error. No way to manually change IP or gateway after switching routers."}
{"Author": "Ronald Shepard", "Date": "July 8, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Yeah it would be great if your timers sunup and Sundown sensors and all that good crap would work with the x10 stuff that I have that you said it would work with come on boys get it together and make it work or I'll go by somebody else's stuff and return Yours"}
{"Author": "Mark Shih", "Date": "July 22, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Some glaring issues.</span> Problem with the app finding devices after a few hours. Have to close app and reopen then the app will see the devices again. Otherwise it just keeps on searching and find nothing. Should have a timer function, device on for 15 minutes to something like 2 hours. Schedule is nice but a timer would be a good function to have."}
{"Author": "Craig Wilson", "Date": "July 13, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Insteon does not love Android</span> Can't believe how badly this app works on Android. I've heard the iOS app is solid, but the scene schedules do not work (especially when using sunset and sunrise) consistently when created or edited in the Android app. Not buying an iOS device, so I might have to return the Insteon devices and keep looking. Extremely disappointing."}
{"Author": "Bill K", "Date": "July 9, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Hardly worth the trouble</span> Devices struggle to connect - nothing works as described....."}
{"Author": "David Straayer", "Date": "July 25, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Just updated to 1.9.1. The \"one day off\" problem is fixed, as well as the \"Schedules apply to the whole week\" problem is fixed also.  Being able to sleep in on weekends restored - Yay! The user interface still isn't a human-factors-sterling example, but it works. It would be nice if schedules could be set with event times being relative to other event times.  That way, when the time of my first class changes, I wouldn't have to edit every scene schedule in the morning ritual.  The concept of \"scenes\" rather than \"events\" has some undocumented surprises.  Have an scene that just turns off some controllers? You need to schedule the \"off\" time, not the \"on\" time."}
{"Author": "Scott Hergott", "Date": "July 23, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Met my expectations</span> Update: Curious scenario; two identical tablets, both latest software... one can control lights, other doesnt unless its rebooted. DONT USE THIS PRODUCT UNLESS FORCED TO.   When a tablet sleeps they disconnect the network and frequently fail upon waking.  Ahh, yet again another Insteon product that fails to delivery.  I've been using Insteon products for about 6 years which is 6 years too long."}
{"Author": "Reggie Petty", "Date": "July 8, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Work good"}
{"Author": "Rodney Vaughn", "Date": "July 22, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Working now. .</span> Once it works.....it DOES work!   HD camera installs are a lot more involved. ...but everything else is nearly automatic!"}
{"Author": "Tomasz Wilinski", "Date": "July 8, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Not a perfect, but now works good."}
{"Author": "Lennart Brune", "Date": "August 27, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Still no sunrise and sunset offsets - way behind."}
{"Author": "don jenks", "Date": "August 4, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Update</span> Lost camera connection with latest version. Update was a bad wifi connection.."}
{"Author": "Peica Sergiu", "Date": "July 8, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Last update is garbage</span> Garbage. Cameras dont work anymore."}
{"Author": "Kris A", "Date": "June 17, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Much better thanks Insteon!</span> Confirmed the following bugs are fixed!    First bug, devices cannot be removed from scenes unless \"force removed\".  Unfortunately \"force remove\" does not update the device, just the app.   This results in device still responding to scene commands.  Second bug, schedule appears off 1 day, to make something happen on Friday I have to schedule it for Thursday, could this be a leap year bug?     I'll update to 5 stars when bugs fixed."}
{"Author": "Robert Jewell", "Date": "August 28, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Getting use to it"}
{"Author": "David Pietrowski", "Date": "July 8, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Great improvement on camera speed</span> This update today greatly decreased the camera connection time when I am on my home network as well as the time it takes to switch from SD to HD.  Much better!"}
{"Author": "derpybanana", "Date": "June 27, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">3g 4g and LTE problems</span> I don't know when this exactly started but I can no longer access my hub from another place"}
{"Author": "evan weiner", "Date": "June 13, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Work very well</span> The app works. In user interaction is awful though. The app needs a complete overhaul so so badly."}
{"Author": "Ken Landry", "Date": "July 9, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">No problems Here</span> Followed directions to the letter, called support when things did not work, some not so friendly but always fixed my issue so hey I am happy!"}
{"Author": "Karl James", "Date": "July 8, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Insteon</span> Won't work when to try to log on remotely."}
{"Author": "AJ MacKenzie", "Date": "June 14, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">No longer works after the last update</span> Starts and then stops.  Latest version works ok. They keep making improvements."}
{"Author": "derek kramm", "Date": "June 15, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Decent</span> Gets the job done, by why why why are there no widgets ??? Would be nice to have access to scenes right on my home screen without having to actually open the application."}
{"Author": "Matt Lehman", "Date": "April 13, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Getting better</span> I really like this app for home control, when it works. 1/2 the time I have to back out to the log in page, menu quit then start it up again so it can  find devices. The iOS app works great as does my echo. Please insteon. I've invested so much in your system. Can't you make the Android app work?"}
{"Author": "David Hole", "Date": "June 7, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\"></span> After six months the instant crashing bug is fixed. The app is back to the same lackluster set of features it has always had. No ability to share control of Insteon devices beyond giving them the full administrative password. Someday, hopefully, the software will catch up to the hardware."}
{"Author": "Bryan Ruscetta", "Date": "May 19, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">App needs overhaul.</span> Needs to be updated. I have had problems connecting the garage opener to this. It is not a simple task to add some items. The look of this app is just plain. Crashes sometimes. Needs to look better. Kinda like the way Asus does some of their apps. Just a idea I'm throwing out there. Don't get me wrong here. I am happy you have a app for this. Just my opinion."}
{"Author": "Tait Cyrus", "Date": "April 28, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Mostly ok but problems with single day scheduling</span> Buggy support for single day scheduling since is off by 1 day. If you want a light on on a Friday you need to pick Thursday. All other features seem to work ok"}
{"Author": "Matthew Moss", "Date": "June 8, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Insteon is a great home automation platform - I have no complaints about the devices, the scheduling, and scenes. However, this app is so out of date, buggy, and all-around a pain to use. It is functional for me, but I don't enjoy opening the app. The appearance and flow from one item to the next needs work. Setting up scenes and connecting new devices needs work.   I love insteon, but I hate this app."}
{"Author": "Greg Pavlik", "Date": "June 9, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Pathetic</span> After a long time Smarthome still hasn't fixed the log off bug when navigating backwards. Also the garage door integration is terrible. It should have an open/closed and use the sensor to prevent unintentional closing of an open door when someone wants to open it."}
{"Author": "Nicole S", "Date": "June 17, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Makes surveillance useless!</span> I have a very expensive camera made by insteon yet this app doesn't record or photograph any activity on the camera and I cant speak through the camera either which it IS equipped for.So basically it's pointless and I wasted a lot of money"}
{"Author": "Michael Boyd", "Date": "June 16, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Lots of small bugs.</span> I have to re-login to get access to my devices every time the app goes to the background. The app is generally unstable...."}
{"Author": "Will Hennegan", "Date": "April 16, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Buggy but works if you're lucky</span> As others have said, this app is crashing hard on the latest Android Cyanogenmod 12.1 builds since November 2015 and still crashes on the latest CM13 builds. This app is great though (when it works) if you have a house full of Insteon devices. I love being able to open/close the garage, lock/unlock the doors, and get notifications when our yard gates open/close. I will update my star rating if this is ever fixed."}
{"Author": "William Ritter", "Date": "July 1, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Very good technology without fees</span> I originally bought the insteon on/off modules and a lamp link and have upgraded to the hub where I now control at least 15 on off modules as well as an outdoor module that controls our pondless waterfall. I have created at least five different scenes including scenes for Christmas that combine other scenes together we also use it to control some of our outdoor lighting especially during holidays."}
{"Author": "Jeff Wohlt", "Date": "July 3, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Poor</span> Very poor...nothing about this easy...returned camera!"}
{"Author": "Jeff Penington", "Date": "June 4, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> I must force stop the app 90% of the time to get it to work because it is unresponsive. The thermostat interface is not very user friendly. The app won't rotate to landscape. I am willing to help make this app better by providing feed back to the developer."}
{"Author": "Michael Vardalos", "Date": "April 12, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Not bad...</span> I have never been able to make the camera move via my phone. It's works on my iPad...  But not in my S5. Other than that (which is a big disappointment)  it works fine."}
{"Author": "Yong Huang", "Date": "May 8, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\"></span> The recent release has fixed the bug that makes this app useless. Video still doesn't work on my phone."}
{"Author": "Jonathan Nalli", "Date": "August 1, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> It's very unrefined."}
{"Author": "JuanPablo Garcia", "Date": "July 8, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Yes</span> Works perfect."}
{"Author": "Brian Cowan", "Date": "June 26, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Adding camera</span> Try to add camera and program stops running and the setup disappears"}
{"Author": "David Yancey", "Date": "May 18, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Love the Tech Hate the App</span> Insteon is hands down the best Home Automation system on the market. However the app is the worst.  Needs device/scenario based widgets, device based favorites, and auto refresh just to start.  Hopefully they resolve these missed features / issues before I finish writing my own."}
{"Author": "Zack Hawks", "Date": "April 25, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Bugs, Needs More Features.</span> Days of the week don't match up to scheduled on/off times. Also, could use a single delayed off timer in the light switch menu, and if that's too difficult, there really should at least be an ARM/DISARM switch for motion/door/window sensors. That last part should've been mandatory upon launch..."}
{"Author": "Ed Echols", "Date": "June 17, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Samsung S7 operating well</span> Sensors, relays, lights all work well. Unlike other comments, I have no crashes yet."}
{"Author": "Jerry M.", "Date": "May 21, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">1 * because I can't choose -100</span> This app and the instructions are in English but might as well be in Chinese because they are extremely unclear. I bet the IT guys who made this stupid app never tried getting it to work with insteon's hardware. Extra lame if you ask me. I can't understand in today's world that we still have inept people running companies. It baffles the mind. BIG THUMBS DOWN. I'm still not successful after countless hours of research and trial with nothing but errors."}
{"Author": "brooke greene", "Date": "June 13, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Works great for me</span> Phone app works great. It does what it's supposed to do. I can turn my lights on and off from any location from Wi-Fi 3G or 4G. My phone is a V10. Works very well my Amazon Echo too."}
{"Author": "Shaun Sayre", "Date": "May 17, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">This app feels like 1990</span> It's horrible controlling my 4 sensors. I have to do 5 steps per sensor to turn them on or off. Choose the sensor, click edit this, click alerts, click turn on motion open,  click on motion off, back out 3 clicks back to favorites screen to do the next sensor, repeat. WAY too many steps to a activate my sensors, very annoying. Come on now, join the 21st century. It's only the app that sucks. The devices and alerts work perfectly. A+ there. I just hate using them because of the app."}
{"Author": "Robert Blanc", "Date": "May 17, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Missing Many Features</span> Fairly reliable...couple issues, but issues have been handled...good tech support.  One thing I would like to see is a widget, with the ability to turn off and on all alerts, or alerts for devices within a zone, with a single button push...as it is now, you have to login to the app, which takes 10-15 seconds or so, then disable or enable each alert for each device one by one.  The app could use a redesign also, with fewer button pushes...Correct this, and I would rate 5 stars."}
{"Author": "Jacques Marjaq", "Date": "May 3, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">So unstable</span> Camera and hardware work fine. Their software for Android is a pain....Support is slow to get back to you. At least one week to reply to emails. Waiting on the phone could take some time. You better leave your phone # for a call back. Support individual was helpful. My problem got resolved but no explanation why it came up in the first place. Upgraded my rating to \"its ok\" when it is working..."}
{"Author": "john verstegen", "Date": "April 12, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Works OK for me</span> A little bit slow to connect but does all it is expected doing.  Would love to have a zooming camera but the HD one eodks fine.  Hungry of the WiFi band however.  Good compromise cost/quality."}
{"Author": "Robert Rushford", "Date": "June 3, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Rob R</span> Easy to setup."}
{"Author": "Jason Kreisher", "Date": "May 23, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Dont understand why we dont have the features that iOS does. No Sonos. No remote."}
{"Author": "essam isho", "Date": "June 17, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> The app still crashing alot I thought the upbeat will fix the problem but no ...hope you fix the issues"}
{"Author": "Scott Hoose", "Date": "May 24, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\"></span> VeryGood"}
{"Author": "Larry Rowell", "Date": "April 28, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Camera Failure</span> As long as I am commected to my local network the camera works fine.  Connecting over the Internet - ain't gonna hapen."}
{"Author": "Gal Lis", "Date": "April 18, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Please make this app usable</span> This app is one of the worst I've ever used, it's like it's laggy, counter-intuitive and difficult to use on purpose. Please take feedback from actual humans and make this usable. And while you're at it add Android wear support."}
{"Author": "PAUL CHANEY", "Date": "July 9, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\"></span> I use the Insteon app for Hub to control my whole house fan.  I have a couple of other switches I haven't installed yet, but this first one was easy. It connected pretty quickly with no problem.  \"Works as described\" is my evaluation."}
{"Author": "Denny Stevens", "Date": "June 5, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Needs a lot of work!!!!!</span> The app constantly has to be rebooted to connect to the hub. Please fix this issue Insteon!!  The scheduler for timed events also has major design issues. Please look at Lutron's or Crestron's lighting programming platform and copy it or at least implement some of its features.  I have over 50 switches in my house, looking forward to the changes guys!!! Thanks"}
{"Author": "jake chan", "Date": "May 9, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Very inconsistent and slow</span> The devices work well and consistently through amazon alexa but this app is slow and half of the time won't even open or communicate with my hub"}
{"Author": "derpybanana", "Date": "June 27, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">3g 4g and LTE problems</span> I don't know when this exactly started but I can no longer access my hub from another place"}
{"Author": "Gregg Ridge", "Date": "May 28, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">doesn't work on galaxy s7</span> worked fine on other devices. it can't even find my hub and searches for it for a split second. looks like my insteon switches are going on ebay"}
{"Author": "Susana Paquette", "Date": "June 21, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> I bought the camera at costco and when i try to sign in, they don't let me in with my password"}
{"Author": "Timothy J Robinson", "Date": "April 21, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Crashes constantly</span> It's been crashing for months.  It never gets fixed."}
{"Author": "Jonathan Somerville", "Date": "January 30, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">2.5 Stars - Instant crash on half our Android devices</span> Can't imagine why this app is so touchy depending on which OS version you are using (and even which provider/manufacturer flavor of that OS version it is!)  C'mon devs...  This app needs some serious help!"}
{"Author": "Greg Chakmakian", "Date": "March 29, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Good, but needs to get up to speed with the rest of the world</span> Its a decent app and, for the most part, acts as advertised.  Its just has a bit of a clunkiness to it.  Its not a refined app by any stretch of the imagination. I'm revising my review from almost 2 years ago where I commented on it not having a landscape view... and it still doesn't.  Looking at HomeBoy and hopefully that developer will be more able to create a great app for Android. It seems like Insteon for Android is a real afterthought.  Their main focus seems to be iOS.  Unfortunately there's a lot more Android devices out there.  Just don't expect to be oohing and ahhing over the experience. Be happy when it works correctly. I use a Nexus 9 and LG G3."}
{"Author": "Brian Bourne", "Date": "April 25, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Doesn't work on cyanogenmod</span> Crashes hard.  What a waste.  I've got a grand worth of devices that I can't use my phone to control which was the entire point"}
{"Author": "Eric Vinson", "Date": "November 11, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Crashes on startup</span> App crashes instantly, unable to use. Cleared cache, reinstalled, nothing is fixing the issue. Android 5.1.1, unable to send crash report as they appear to have overridden the default android behavior and it gets caught in a crash loop. Still happens after latest update."}
{"Author": "Brendan Ottman", "Date": "April 13, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">FC on Marshmallow</span> Still unusable on 6.0 \"we noticed our app quit unexpectedly.\" Even the report notification crashes!"}
{"Author": "Billybob Penner", "Date": "April 13, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Terrible design. Terrible performance."}
{"Author": "Jason hight", "Date": "February 14, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Unstable on android.</span> Running Android 5.0, Samsung S5. 56 dual band WiFi and Verizon 4g mobil This app will not run in the background.  It crashes whenever I switch to another app.  The UI still appears to be running and you can move through screens, but all devices become unresponsive.  It exhibits excessive battery drain upon the phone in this state.  The only workaround is to close and restart the app.  The app is extremely slow to access devices.  The Insteon thermostat can take up to 1 minute to access. Barely usable."}
{"Author": "Keith Stefanowicz", "Date": "February 1, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Multiple homes not supported.  Dual controlled not supported.   the insteon app in apple works...  come on and please update these issues!       2/9/2015. Still no update, Samsung S5 and this app does not work.  Any timeline or work around?  Update :2/1/2016 Still no update or fix for use with Android.  Nor any communication from Insteon."}
{"Author": "Kristopher U", "Date": "December 14, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Add multiple Account drop down menu</span> I have two seperate Insteon accounts that I log into. It would be super convenient if on the log on screen there was a drop down menu under the email line which could store multiple Insteon accounts.  Also, you have a great product with Insteon hardware, why are you ruining it with a poorly designed app that is lacking so many features and buggy as other people have described in their reviews? Improve the app and it will truly be a 5 star product. Is adding proximity activations a possibility in the future?"}
{"Author": "Michael Vardalos", "Date": "April 12, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Not bad...</span> I have never been able to make the camera move via my phone. It's works on my iPad...  But not in my S5. Other than that (which is a big disappointment)  it works fine."}
{"Author": "John E. Boal", "Date": "April 12, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Still crashes 4/12/2016</span> Complete continued failure. OnePlus one on Android 5.1. Crashes immediately, \"we noticed our app crashes on startup\""}
{"Author": "Gregory Strike", "Date": "February 18, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> It works... Kinda?  When I launch the app for the first time the app is happy happy happy and pulls data, works great!  However, if I switch to another app and then go back to the Insteon app it is unable to get the latest states from my Insteon devices.  I have to force close the Insteon app and reopen it in order to control my devices and/or get updated states."}
{"Author": "Corey Rowe", "Date": "December 18, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">This is ridiculous</span> I have insteon hardware I cannot use.  Android app doesn't work on lollipop.  Developer chooses not to resolve or respond to tickets.  Shame on me for not going with smartthings. No reason this app shouldn't get better.  Instead it now crashes and the developer doesn't seem to care."}
{"Author": "max jos", "Date": "February 27, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Crap crappier crappiest!.</span> Update::Six months gone still no fix/update.                                                     You have great hardware. Learn app development from Smart Things and you will have a great product experience. Considering this is a smart home app, how can you keep it not working for so long!!!!. Crashes right away. Android 5.1.1 AND 6.0.1"}
{"Author": "Gary Boone", "Date": "December 29, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> The app works OK when in use. It's when you're not using it that's the problem. Several times a day, I see a pop-up on my phone that says, \"Insteon has stopped.\" Again, this is when I'm not using the app, nor have used it recently. Android M OS."}
{"Author": "Adam Parsons", "Date": "December 30, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Poor</span> Many disappointments which includes: constant crashing when not in use, slow response, bad ux including silly logout when navigating back, has difficulty when switching between WiFi and cell.  The worst part about it is that I don't see many updates which leaves me to believe they are not actively trying to improve the product and makes me question my invest in the platform."}
{"Author": "Bob Phangureh", "Date": "April 12, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Crashes Upon Opening</span> APRIL 11 2016 UPDATE: Still crashing on startup. -  PREVIOUS REVIEW :Can no longer use.  Crashes Upon Opening"}
{"Author": "Thomas Paine", "Date": "November 18, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">App Crashes</span> Updated and hoped to resolve my crashing issue. Unfortunately it did not. Still crashes at opening. Please fix. I can't control my insteon light bulbs. Its not only inconvenient switches. I bought bulbs."}
{"Author": "Joel Wilhelm", "Date": "December 1, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Unable to open</span> App worked mostly to design since last October. Recently updated the software on my oneplusone phone and now the app won't open. Just crashes before start up. Had to buy mobilink and a 994i to control to operate insteon system. This issue should have been fixed immediately and its been 2 months with no cure ( I check back weekly)"}
{"Author": "Divya Jain", "Date": "November 16, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Don't even open</span> It atleast used to open earlier (with several other issues) but on latest android version it won't even start. The app would crash as soon as it opens. Pretty useless. iOS one seems to be better."}
{"Author": "Dennis Hamilton", "Date": "January 12, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Instantly crashes</span> I can't rate this app any higher as it Instantly crashes every time I try to open it.  I tried uninstalling and reinstalling same thing. I wish I never bought any insteon products ,  none of them are easy to install or reliable."}
{"Author": "Adam Marmon", "Date": "December 16, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Timeouts and lost connections</span> App hangs up in the background too much. Every time you leave the app you must close it to have it connect to the Hub again. Please get this fixed. Really shouldn't happen. Doesn't with my Nest App."}
{"Author": "Ben Borm", "Date": "December 22, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Crashes</span> Constantly has a popup that says it has crashed when I am not even using it. Seems to have started when my phone upgraded to marshmallow."}
{"Author": "Derek Norman", "Date": "January 7, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Hard to use if it won't open.</span> I've used this app for over a year without issue. Suddenly now, it crashes before opening. Reinstallation does not help. Too bad! :-("}
{"Author": "Nate Waddoups", "Date": "April 12, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Just doesn't work.</span> This crashes as soon as I open it. The windows phone insteon app is the same. (Trier again April 12 2016 - still crashes at startup.)"}
{"Author": "Mark King", "Date": "April 23, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Needs Work.</span> This is not a terrible app, but there is definitely room for improvement. I've been researching a lot of home automation and I really like these products, but will probably not be relying on this app for now."}
{"Author": "Danny Muntean", "Date": "January 17, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Force Closes Immediately</span> Well the app was working alright up until 10/26/15. Now it just closes immediately after launch. Please fix it! Update 1/17/16: After three months and countless bad reviews, how have you not fixed this problem? Do you even care?"}
{"Author": "Ken Faubel", "Date": "December 29, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Slow when it works</span> it seems like Insteon has so much potential given its hardware architecture but it fails to deliver in operation. The latest version pops up with a failure when I am doing other things. When it does work out is really slow. I have too much invested in devices to give up but even with a 2nd gen hub it is still slow and buggy.  Sigh..."}
{"Author": "Carlos Latony", "Date": "January 3, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">3rd party app surpasses tremendously.</span> Before I've wasted money and purchased the hub, I used a 3rd party app called Foscam. Without the use of a hub I was capable of viewing my camera, listen in, and speak into the mic (on and off of network with crisp video). With this app I experience extreme lag in video and audio, and can not speak into a mic. App developers please step your game up. I expect more from a renowned company. VERY DISAPPOINTING!"}
{"Author": "Joe Dahlquist", "Date": "January 25, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> It's ok when it works. But when I am not using it, randomly during the day, it will pop up \"Insteon has stopped.\" In the middle of using navigation, for example. And this problem has been going on for a long time, even though I always keep the app up to date. Unacceptable. I would steer clear of the brand."}
{"Author": "Damon Brown", "Date": "April 12, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Great system - needs widgets"}
{"Author": "Woodie Bowe", "Date": "November 14, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> I have been using insteon for years with great success but unfortunately this app is horrible. The Hub is limited in what it can do but trying to use this on a tablet is just bad. The screen does not auto rotate so you can only look at it one direction and the overall user interface is clumsy and confusing. Insteon PLEASE get with Smart Things and deliver a hub/app that is really useful.   BTW - I Like Insteon and the way the hardware works way better than all the rest."}
{"Author": "Jen R", "Date": "January 31, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Incorrect day, time &amp; hardly works</span> Tech support doesn't answer emails. It shows wrong date &amp; time. I can sometimes get it to work on wifi but never on data. This app is useless. I can only see the camera sometimes while on my wifi at home, which defeats the purpose of why I bought it.  Does anyone monitor these issues?  I keep emailing but no response."}
{"Author": "", "Date": "December 7, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Needs Work (C- at best)</span> Inconsistent and incomplete.  Sometimes forgets my password, sometimes won't authenticate, sometimes won't connect to hub.  Sometimes I have to login - sometimes I don't.  I can work around by deleting cache, data, force close the app and start over - but that is real annoying.  iOS has multiple house support but Android does not.  All-in-All, not a professional grade app.  Could also use a functioning web interface for browsers."}
{"Author": "Nicholas McGahan", "Date": "November 22, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Good physical product, poor application</span> I've seen apps made in a day that work better with less bugs. It's 2015 and why can't you afford good programmers? If you can't come out with a usable product why are you even in the business then? Turning on and off lights should not require me to log in every time and dig through the app. Persistent login and widgets would make this wonderful. At present it's easier and less frustrating to physically walk to the light and turn it on/off, which to me means you failed at what you were trying to achieve."}
{"Author": "zdravez", "Date": "January 17, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Junk</span> Slow to load; slow to execute commands; frequent crashes; unnecessary applicacion perermissions requests - microphone and camera?????... Insteon, please provide us with.an useable application that will actually convenience us ... Not the other way around!"}
{"Author": "Konrad Stollsteiner", "Date": "April 19, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Push notifications now working</span> I just upgraded to a new verizon galaxy s7 edge with marshmallow and after installing the insteon app the push notifications dont work on the new device but still come through on the older device over wifi. UPDATE.  after following insteon support and clearing cache,  push notifications are now working"}
{"Author": "Paul Z", "Date": "March 2, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Marginal at best</span> No widgets. No Tasker plugins. Crashes. Hangs and needs to be killed before becoming responsive again. Running on Nexus 6 and Nexus 5X and experiencing same results on both devices.  If it were stable and had widgets I'd give it 4 stars.  I couldn't give it 5 unless it offered Tasker plugins."}
{"Author": "mike janakes", "Date": "April 23, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Doesn't work"}
{"Author": "Sean H", "Date": "December 5, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Meh</span> This app was clearly an afterthought. I'm waiting for updates that improve it. How about Android wear support? Widgets? Did you guys just hire a contractor to make the app and then nothing else? You guys make the best controls that fit unobtrusively yet you shirk the amazing extras your product is clearly capable of."}
{"Author": "Bryan Erickson", "Date": "November 16, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> App keeps crashing Android 6."}
{"Author": "Aboody Zomar", "Date": "February 21, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Crashes all the time</span> Whenever i open it and tap on anything it crashes directly,  please fix it asap"}
{"Author": "Mike Martin", "Date": "January 17, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Crashes on startup.</span> One Plus One running CM12 bacon."}
{"Author": "Brent", "Date": "February 17, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Terrible Company</span> This company seriously doesn't give a hoot about their customers. Doesn't respond to emails, refuses to modernize their app and is so closed off that there are zero alternatives to their lousy software. I'm selling all my Insteon devices and switching to Hue. I have seriously never seen a company that cares less than Insteon."}
{"Author": "Javier Luna", "Date": "January 21, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Please update. Ever since the latest update I keep having to click Get latest Configurations in order to turn any lights on or off. Randomly force closes even when running in the background."}
{"Author": "Tj Carlson", "Date": "February 18, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Worst company to deal with ever</span> Good idea but the product absolutely sucks! Don't buy the camera for sure"}
{"Author": "Julen Garritz", "Date": "April 12, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Crashes on 5.1.1 oneplus one</span> New comment on April 11: Still crashing... New version also does not work... Tried to install several times, does not even start... Any workaround? PLEASE FIX IT!!!"}
{"Author": "C Luengas", "Date": "April 12, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Broken for a very long time! Even v. 1.8.7</span> As many others have reported, the latest version of Insteon for hub does not work with some Android 5.1.1 phones. It's very sad that Insteon can't hire a good Android programmer."}
{"Author": "Manny Basilio", "Date": "November 16, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Now unusable after 5.1 update.</span> Please fix."}
{"Author": "Michael Wicherski", "Date": "January 19, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Won't even launch</span> Crashes as soon as launched, not even a splash screen. Get a message to submit details to support, does nothing."}
{"Author": "Platt Barber", "Date": "December 27, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Sluggish and confusing</span> No response to my question about having to constantly relog into the hub. Reminds me of WeMo. Lol not quite that bad.....but pretty bad."}
{"Author": "Randall Land", "Date": "November 24, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Program is good but i have issues</span> Whenever i click on one of my cameras on my phone,  a Samsung note 5, it crashes. . I really want to be able to look at my security cameras when i get an alert"}
{"Author": "john schoenstein", "Date": "January 21, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> After many many months of the notifications not working, they suddenly started working this weekend. But there's no history of alerts one you've dismissed them.  I'll stay with email notifications."}
{"Author": "Russell Grover", "Date": "March 25, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Problems with time and bad schedule</span> I also had problems with the wrong time I actually had to set my location twice to get the correct time. But just like others I switched the DST on. (Because it is now) and the time didn't change. So either the program really knows where I am? Or the DST doesn't work. Another thing that annoys me is you only have one schedule that can be repeated for the whole week. Example: you can have a light on from 6-7am Monday through Monday, but can't have different time Saturday or Sunday? Or more than once a day."}
{"Author": "Michele Nasoni", "Date": "December 30, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Crash</span> I cannot use. It crash at start"}
{"Author": "Matt Corby", "Date": "December 5, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">How can I do less than 1 star?</span> App is amazingly slow, doesn't include obvious stuff like a widget, programmed by morons who don't understand that pushing that back button shouldn't log you out, and now constantly crashes in the background, interrupting my phone usage several times a day even when not using the app.  I have had this app for years over several devices, and it just never gets better.  Hey insteon, stop subcontracting your apps to the cheapest Indian app farm you can find and hire a real programmer."}
{"Author": "Nathan Miller", "Date": "January 18, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Gets worse and worse with every relase</span> App needs some major work. Constantly force closes even when not running the app"}
{"Author": "Willy Clarkson", "Date": "November 11, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Still no sunrise/sunset offsets</span> Basic app ok. However, I've been switching my lighting to LIFX. Waiting for evening lights until sunset and the room is dark. With LIFX they are set to 30 minutes before sunset. Don't stumble in dark."}
{"Author": "Dan mosera", "Date": "December 16, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">App is horrible with new hub 2</span> Slow to sync. Must refresh app to connect.. What happened?"}
{"Author": "Billy Zimmerman", "Date": "January 23, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Terrible - continuing issues</span> Push Notifications totally unreliable. App needs a refresh button. If app running for long, all icon status indicators just twirl on all devices, camera video blank. The workaround is to restart the ap.  Also not all device icons show at application start. I've had Insteon hardware for about 18 months, do not make the same mistake I did,  and invest a lot of money and time  in this terrible Insteon garbage, also do not get suckered into upgrading to the new hub, I found it won't fix any of these issues..!"}
{"Author": "Jeremiah James", "Date": "December 20, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Works on most android ROMs, but better on apple ROMs</span> I think insteon is pretty great. Have used their stuff for many years. But I have had their app installed on multiple Android and Apple devices. Their app definitely works better (easier to use) on Apple devices. On some of my rooted Android devices with custom ROMs, the app won't even open. But I can't blame Insteon for that. Insteon is great software and hardware. Keep up the good work guys."}
{"Author": "Ben Borm", "Date": "December 22, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Crashes</span> Constantly has a popup that says it has crashed when I am not even using it. Seems to have started when my phone upgraded to marshmallow."}
{"Author": "James Shelby", "Date": "November 24, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Bad application</span> I have tried this on both my Android and ios phones and neither works reliable to turn lights on. The products disconnect often and for the cost seems extremely problematic with the reviews and hub issues"}
{"Author": "Arthur Levine", "Date": "January 28, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Waiting on a  fix for Samsung S6 camera and rooms view together . Works great on my IPAD. The application should save username and password, however I often have to re-authenticate on the Samsung phone. I would like to  be able to review my cameras in the latest MS Windows o/s, as well as other control modules at the same time; Example light a dark room, and view what's there instantly, instead of switching back and forth. The Tech Support is mostly World Class. I have been able to find better prices on modules from various retailers. Smart Home is famous for bundle sales. It would be nice if they would have more sales throughout the year on single products."}
{"Author": "Arthur Bain", "Date": "January 28, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Train wreck</span> The app crashes when I try to change any setting.  I can't add new devices or edit rooms.  I can't even change between cameras. Useless I say totally useless. Fyi I don't want an iPhone"}
{"Author": "Scott Hartman", "Date": "January 6, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> This app has gone from terrible to something worse than terrible.  All it does is force close. Why is it so difficult to make an app that works.  Nuke this thing from orbit, hire new programmers and START OVER!!!!!"}
{"Author": "David Riesen", "Date": "March 20, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Insteon app</span> Terrible app!!!! Keeps crashing. Insteon hates android devices. Bought their camera and have had nothing but problems.  That will be the last Insteon item that I will buy."}
{"Author": "Jonathan Willoughby", "Date": "January 4, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Needs a re-do, I think</span> There always seems to be SOME problems with it. Right now, my problem is it won't connect over the cellular network, but connects fine when I'm in the local network on WiFi. It seems like Insteon spends a lot of time on new hardware and lets their apps slowly crumble until enough people complain."}
{"Author": "", "Date": "December 9, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Sanity Saver</span> The menu paths need disconnecting from legacy architecture. It feels like a series of bolt-on scripts that are wrapped in an app. Just redo them. Adding a device and factory resetting devices should be easy. Reordering the scenes and grouping them in a way that is useful to me would help take the stiffness out of the UX. Complains incessantly if phone is in airplane mode -annoying! With many devices and scenes, this app is a very useful tool. Works with old devices and new; Android tablet and phone; 2.4ghz."}
{"Author": "Russell Ambeault", "Date": "February 28, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">A world of suck</span> Slow. Can't see fullscreen video. The interface is just awful. And half the time even light switches don't work. It's just very very bad. And slow."}
{"Author": "Tom Gruszka", "Date": "March 19, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Crashes</span> This application crashes as soon as it's open. I'm stuck with a product I cannot use. Please fix this asap."}
{"Author": "Joel Pou", "Date": "December 17, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Piece of @#$%&amp;</span> The app crashes instantly. Can't open it. I'm using Android 5.1.1."}
{"Author": "Dave Moddes", "Date": "April 6, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Slow and cumbersome app. Have promised multi-hub support for well over a year and nothing new. They cater to IOS and could care less about android. The updates are petty when a complete over haul was needed within a few months of its release. Check out the CEO's home, that is where the R&amp;D monies went. Early innovators in home automation that will be swallowed in the next year as they truly could care less about the customers that have supported them through the years. As each device dies in my home, they will be replaced by another companies product if the support stays as sub par as this."}
{"Author": "Don Seiford", "Date": "April 18, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Can I give it zero stars? It's so frustrating that this app will crash on every Android device I own. It crashes immediately every time. I have to uninstall the app to make my device stable again.  I have a ton of money invested in Insteon devices that I used to be able to control. Now I can only control them from my PC using the Windows Store Insteon app. It's not practical to use my PC every time I want to turn something on or off.  Since I upgraded to Android 5.x the app started crashing. Even the new 1.8.7 that was released April 11, 2016 still crashes on all my devices. If you look at the reviews, the majority of devices that are on Android 5 or later have this issue. For security reasons, I'm not going back to Android 4.x to make this app work.  Insteon PLEASE FIX THIS APP!"}
{"Author": "Graham Bowles", "Date": "December 19, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Crashes immediately 5.1.1</span> App will not run on Android 5.1.1 ... Crashes immediately"}
{"Author": "Ricardo Lima", "Date": "January 16, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Crashes constantly in the background</span> Besides being a very poorly designed and implemented app, this app crashes several times a day in the background, for no reason. Please work on fixing this major issue!"}
{"Author": "John Mendel", "Date": "November 24, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Update it already</span> Been waiting 3 months for the Android update.  Cannot see shite with this 1/3 screen camera viewer."}
{"Author": "David Smit", "Date": "February 21, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">My hub is now worthless</span> Doesn't work on 6.0 which all of our devices are now on. My hub is useless now since I can't open the app on any device. Terrible customer support."}
{"Author": "Mike Bassi", "Date": "January 15, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">keeps crashing when app is not open</span> 5 star to a 1 star app keeps crashing on marshmallow (nexus)"}
{"Author": "Jeff Sherman", "Date": "December 17, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Wont even install</span> On a galaxy note 4 running android 4.4 kit kat. It gives me a cant install to usb memory or sd card. There is almost 16gb of internal storage left and almost 50gb on the sd card. What gives?"}
{"Author": "Mark Evans", "Date": "October 24, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Still no basic function</span> Still won't control both circuits in my dual outlets."}
{"Author": "Vann Cook", "Date": "November 3, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Simple Works</span> Not powerful for schedules works well for remote operation of cameras,switches and check in on sensors."}
{"Author": "Israel Acosta", "Date": "March 8, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Don't if the app is on 100%  but it kicks me out and can't setup"}
{"Author": "Randy Oestreich", "Date": "March 6, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Insteon for hub"}
{"Author": "Travis Premore", "Date": "November 2, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> App crashes immediately after launch please fix now! All of my cameras are useless."}
{"Author": "Marshall Elliott", "Date": "November 4, 2015", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Works for me</span> I was skeptical at first because of the reviews I read, but so far everything is working perfectly for me.  I even have the leak sensor attached to my saltwater aquarium."}
{"Author": "Manny Basilio", "Date": "November 16, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Now unusable after 5.1 update.</span> Please fix."}
{"Author": "Bill Carson", "Date": "April 12, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Works perfectly. No crashes, no bugs. Interface could use an update but not an issue for me."}
{"Author": "Paul Kiely", "Date": "February 17, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Complete Redesign Needed</span> Poor interface.  Difficult to get the information you're looking for."}
{"Author": "Patrick Ecord", "Date": "February 14, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Doesn't work on latest android, crashes"}
{"Author": "George Su", "Date": "October 25, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Don't fix bugs</span> I reported that the scheduling no longer works after the update in August. Support said they would look in to it, and find another device that still works, to program the schedule. This latest update still doesn't work. Doesn't seem like Insteon cares."}
{"Author": "Talla Vixen", "Date": "March 1, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Help</span> Can't find the Hub"}
{"Author": "Matt Pocock", "Date": "January 19, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Constantly looses connection with the hub. Sooo frustrating. Had to uninstall it."}
{"Author": "Chad Olson", "Date": "March 14, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Terrible</span> Don't waste you time on this. Call the call center and wait line is an hour."}
{"Author": "Gail Macpherson", "Date": "November 25, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Sucks</span> Crashes everytime I open it."}
{"Author": "Nicanor Mandin", "Date": "November 10, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Remote access hub</span> Very good tools and expandable."}
{"Author": "Dee Hedley", "Date": "October 10, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Whole house insteon &amp; terrible android app</span> Everytime I open app I have to login again, no way to change your email address and if your system crashes and loses memory you have to reinstall all of your devices. Our entire house is insteon &amp; if I knew this about the android app I would have NEVER used their products. Improve your app, too much money for such terrible follow up service."}
{"Author": "Dennis Hanley", "Date": "October 6, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Used to work</span> As many others have reported, the latest version will not run at all on my Motorola RAZR MAXX or my Asus tablet. My home automation system is totally in the crapper! Please someone fix this blunder soon!"}
{"Author": "Brett Linn", "Date": "October 25, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Company doesn't support the android app as expected.</span> If you have an iOS device the app and hardware work as expected. The android app apparently does not have as large of a development team. Have been waiting a year for my dual outlets to get the promised update that will allow them to be controlled independently as advertised. Insteon also needs to get with the program and add home screen widgets."}
{"Author": "Rodrigo Lopez", "Date": "October 25, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">App crashes a lot</span> Cannot even open this app. Used to work great, but it now crashes as soon as I try to open it. Please fix it."}
{"Author": "Dean Cooper", "Date": "November 4, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Working with LG G3 and Galaxy S5 but....</span> I set up my hub and controllers yesterday and also linked LG G3 to hub. All my devices are working as advertised. Also linked my wife's Galaxy S5 to hub and everything is working from her phone. This version is 1.8.5. I loaded Insteon app on my Kindle Fire HD, signed into my acct. but device wouldn't connect to my hub. Hopefully these issues will be fixed soon. After all the negative reviews I have read I will be apprehensive to update this app."}
{"Author": "RudmonRH", "Date": "October 24, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">October 25. September 22</span> Well I'm disappointed lately half the time I  use this there is some problem.   It requires a password or reboot the phone.   Donot buy this product.   They cannot get basic right   I'm  very unhappy with this product when I bought it in the winter.   There was a update in Augest that elminated the catastrophic firmware updates.   But, had frequent password reentry.  The most recent update, two weeks ago is much better.   The only flaw is occasional \"get latest  confuguration\".  Not perfect but much better."}
{"Author": "Christian Rubach", "Date": "October 24, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Please Fix !!!</span> App now crashes immediately after launching on two phones - even after reinstall ... Can no longer use Insteon equipment. Please fix ASAP!"}
{"Author": "Vitaly Shvydchenko", "Date": "February 25, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Do not start</span> Not working on One Plus"}
{"Author": "Aaron Nelson", "Date": "September 30, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Unstable, unusable</span> Wow. This is what you get from a company after spending thousands on their hardware??? It can't handle switching networks without rebooting the phone. It randomly deleted switches from scenes. It takes minutes and many attempts to log in. Usually requires a reboot and crashes frequently. Hopefully if you're reading this review it's not too late for you to find another brand of hardware for home automation."}
{"Author": "Joe Comeau", "Date": "October 28, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">House not controable</span> I've spent $500 on switches and link modules and now I can't control them, as the app crashes every time after the latest updates.  Used to be great."}
{"Author": "Arash Hamidi", "Date": "January 29, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">0 star</span> This app is horrible. Not working with Samsung Galaxy S6."}
{"Author": "", "Date": "November 24, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Crashes and can't find hub</span> It crashes on one of my phones and can't find my hub on the other"}
{"Author": "Doug Underwood", "Date": "November 4, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Every time you update the software you create more problems and more time spent trying to get all the different devices to connect or work properly together. How about spending some time fixing all the bugs and lack of control over the devices you currently have on the market and start fixing all the software issues and Apps with the IP/WiFi cams and Thermostats. Etc. before creating more problems."}
{"Author": "James Thompson", "Date": "April 5, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Horrible!!!</span> Every time you go to different devices the app restarts.  Doesn't do it on ios."}
{"Author": "Michael Wait", "Date": "November 8, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Using insteon outdoor HD wifi camera</span> When I first started using this I went to add the camera through wi-fi and it crashed each time even after it said camera found. So I have to use an ethernet cable to get connection. I can't see the footage when I'm not attached to the wifi either. Disappointed with app. Camera is good quality though. Using Samsung Galaxy S6"}
{"Author": "", "Date": "December 30, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Does not work at all"}
{"Author": "Chuck Bigbie", "Date": "March 23, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Crashes</span> Does not work with HD camera crashes all the time."}
{"Author": "Maciej Szefler", "Date": "February 11, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Complete garbage.</span> Crashes on start."}
{"Author": "Mark Seniow", "Date": "October 27, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Latest version crashes when opening.</span> Can not control any hubs or devices with this latest version. Please resolve this or at least publish an older apx until its resolved"}
{"Author": "Daniel Sanders", "Date": "March 16, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Does not connect to the insteon HD camera"}
{"Author": "Willie Beasley", "Date": "February 22, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Not working with Samsung note 5</span> Update, working now!"}
{"Author": "Ed Moody", "Date": "November 12, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> App crashes on Android 5.1.1"}
{"Author": "Scott Wilson", "Date": "November 10, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Continued problems staying connected.  Support for this product is dismal. Just does not work with newer versions of Android.  Needs lots of work......"}
{"Author": "Frank Kroening", "Date": "September 16, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Does not work with all insteon devices</span> Is not a replacement for houselinc. But houselinc will not work with new devices. Please update houselinc. This app is crap."}
{"Author": "Dave R", "Date": "August 8, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Latest update broke Settings access</span> S6 latest update, when trying to open Edit this or Edit Settings it force closes, unable to add new equipment I just bought. Seem to only happen on home wireless with a camera."}
{"Author": "David Schapel", "Date": "August 18, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Clunky interface</span> It seems like it should be easier to use. Stat doesn't reliably connect."}
{"Author": "Michael Hudson", "Date": "October 1, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Can not open app. Crashes on launch. Used to work fine."}
{"Author": "Ruben Ohanian", "Date": "October 19, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Galaxy S6 edge</span> After log in it kicks me out of the app."}
{"Author": "Asif Rahman", "Date": "September 16, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Can't even open... keeps crashing</span> Bad app. Could not launch!"}
{"Author": "Ken Beckett", "Date": "August 23, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> UNBELIEVABLY BAD!  Does not work at all for me without crashing upon doing just about anything at all on my S6.  The latest version supposedly fixed some crashes - NO, it still cannot run without crashing on my phone.  Completely unusable, and therefore my huge investment in Insteon devices has been rendered almost useless, also.  Sadly, it USED to work OK - whoever is working on this app is making it worse, not better!!"}
{"Author": "Richard B", "Date": "September 20, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> After automatic update, Insteon app crashes and now doesn't work."}
{"Author": "Larry Layten", "Date": "October 6, 2015", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Was a router configuration problem. Works great</span> Was working. Other controls and status works,even control of cameras."}
{"Author": "Robert Lanza", "Date": "August 9, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Great so far…. But!</span> Update: Latest version still did not fix being able to control upper and lower of the Outlet model: 2663-222 with the HUB.. Plus app is totally unusable now. All module's status icons show as everything as ON even when everything is OFF. A major fail!"}
{"Author": "Patrick Careau", "Date": "August 21, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Apps is more developed for Apple devices. On Apple, Android or Windows App, no ones have the same options. I have to take 3 differents apps to have all functions. Does not work fine on Android"}
{"Author": "Jim Sadowski", "Date": "August 27, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Bunch of junk</span> It crashes everttime I make or receive a phone call on my s6."}
{"Author": "Christophe Buron", "Date": "September 30, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Disappointing app that ruins home automation</span> Update - latest app update force closes for my tablet... - Insteon was cheap and easy to install. This app does not leave up to the expectations of the product. Push notifications randomly stop working - app needs restarted, but you don't know it... Sensor settings update also randomly do not want to apply. All revolves around this very bad app. What a shame to publish an app like that!"}
{"Author": "Josh Davis", "Date": "September 16, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Getting better</span> This app has major issues. Upgrading my original one star to two to 3 stars because Insteon seems to be making an effort.  UPDATE #1: Changing the time zone/location crashes the app using android 4.4.4 on the oneplus one. UPDATE #2: The scenes are working again, although there are still some scheduling bugs where devices turn ON at the incorrect day. UPDATE #3: the Timezone crashing seems to be fixed.  Upgrading to 3 stars. UPDATE #4 app is much more stable after several updates, upgrading to 4 stars! Good job insteon!"}
{"Author": "Dean Herzberg", "Date": "August 22, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Awful</span> For the cost of these devices, one would assume that they would function flawlessly. The app and the system is unbelievablely poor."}
{"Author": "John Lally", "Date": "September 16, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Crashes on opening</span> I havea Samsung Galaxy S4. This app worked ok for a couple of weeks. Now it crashes on opening. I feel like I wasted my money on expensive components I can't use."}
{"Author": "Carson Brooks", "Date": "August 11, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">1.8.1 update bad</span> The 1.8.1 update really messed things up. Icons not showing correct status, crashes app when trying to update house location, battery usage is way up. Need a rollback."}
{"Author": "Bruce Mallett", "Date": "October 12, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Consistent: stays poor over time</span> Slow to sync., gives \"Connection to hub has been lost\" after many operations, no way to export/import configurations, if your hub dies and you get a new one you must first delete your old account; no way to delete old account without first connecting to old ( non functional) hub, misidentifies devices, ..."}
{"Author": "mikefoyenet", "Date": "October 15, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Used to work...</span> Push msgs stopped working. Installed latest version and now it crashes. No fix available for android. Apparently they don't test very thoroughly before releasing new versions. Whole system is now useless.  Thanks Insteon!"}
{"Author": "Frank Czap", "Date": "October 11, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">New and improved version sucks!</span> Wow. We went from a stable working version to new and improved crap. Nothing works properly and all tech support will say is buy another signal booster. Ah, my system was working just fine for almost 3 years, now you change software and say the problems are with the system. Please hire a qualified programmer."}
{"Author": "Tommy Dieringer", "Date": "August 29, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Pretty pathetic app</span> Worked somewhat decent prior to latest update. Can no longer connect cameras in app. Had to reset them all manually and third party app to view them over wifi. Stuff like this is what makes companies become irrelevant. I like insteon products and hope they get it together."}
{"Author": "Herbert Glaser", "Date": "October 12, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">The app is broken</span> It now crashes on launch. Insteon,  get your act together or consumers will move on. Sooner than you think."}
{"Author": "Mark Steckel", "Date": "September 30, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Half baked</span> This app still isn't user friendly you have to go home all devices to load your cameras and at that they commonly won't load. I congratulate them for working on it but it needs help. There is no way to access it from the Web without the app. No way to set alarms or sirens, no way to record motion activated video, etc. Also sometimes it remembers my password to log in other times it doesn't. Sometimes it seems to log right in with no password in the field. Very odd."}
{"Author": "Jarod Hart", "Date": "September 8, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Good not Great</span> Currently I use the hub and light switches to control lights in/around my house. I have made purchases to add to the system with smoke detectors (with the smoke bridge), and plan on getting the water leak detector for my basement. Insteon lacks in a couple of areas: 1. The look/feel/ease of use of this app leaves a lot of room for improvement. I hope to see that soon. 2. Wish the system was open to others (e.g. Chamberlain MyQ for my garage door, my Trane thermostat, etc.)."}
{"Author": "B AC", "Date": "August 10, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Terrible app, equipment, and support!</span> Everything about this product is terrible all the way from the product itself to the customer support offered by the company! Most apps traditionally update to fix issues whereas it seems that Insteon prefers to push out updates that remove features or cause the app to cease function entirely. I will definitely be switching too smart things as soon as I can! Thanks for nothing Insteon for your latest update on 8/7 that has now rendered this app and all of my equipment useless. It constantly crashes now!"}
{"Author": "chevyfried", "Date": "September 28, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Let me start off by saying the hardware by Insteon I find to be amazing and reliable.  I have the assurance kit, nothing crazy, and all the sensors and gizmos work as they should, would give those 5 stars.  Now on to the app, the Achilles heal of the bundle.  It is a confusing mess of menus and poor flow.  If I launch straight from icon, it will auto login like I want.  But I hate that if I hit the back arrow to try and get back to the main menu or even close the app, it brings me back to the login screen without a password prefilled and then if I hit it again it wants me to either add an account or enter my info.  At that point i either have to type in the password, or close it completely to relaunch which then makes it sync with the hub again.  If you already have an account, there is no reason why it should even go to that page.  The menus are terrible.  There is no button to go straight to your devices, you have to click the room first then all devices.  I have only 5 devices, i find this annoying.    The thermostat icon is always at the bottom, no matter if you have one or not."}
{"Author": "Joseph Absher", "Date": "October 7, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">It works... Barely...</span> Always losing connection, slow response, counter-intuitive, buggy."}
{"Author": "Marcus Cage", "Date": "September 24, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Horrible</span> Worst app ever. Takes forever to load, cannot control ac like i should, slow to respond. Bring back houselinc"}
{"Author": "Aaron Nelson", "Date": "September 30, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Unstable, unusable</span> Wow. This is what you get from a company after spending thousands on their hardware??? It can't handle switching networks without rebooting the phone. It randomly deleted switches from scenes. It takes minutes and many attempts to log in. Usually requires a reboot and crashes frequently. Hopefully if you're reading this review it's not too late for you to find another brand of hardware for home automation."}
{"Author": "Brandy Williams", "Date": "August 11, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">New updates suck</span> The new update sucks. I can't take the constant notifications with sound. There should be an option to turn the sound off and the phone only vibrate."}
{"Author": "arash bakhtmand", "Date": "August 26, 2015", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\"></span> It is handy although sometimes it can not connect"}
{"Author": "Kevin Wszola", "Date": "October 2, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Not User friendly</span> Not really user friendly, camera's won't work on Android version of the app, but work on iphones version"}
{"Author": "Jim T", "Date": "September 2, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Won't connect</span> Does not work on Samsung tab"}
{"Author": "Shawn Dunn", "Date": "October 23, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Terrible</span> The app seems unfinished, unrefined. Even when I'm home and connected to my WiFi thermostat rarely will load on the screen. Have not been able to adjust the temperature from my phone once I get an error every time. The time of day programming mode on the thermostat itself doesn't work. Had to recalibrate the temperature sensor out of the box. Absolutely nothing works right and the app just plain sucks, insteon is a joke"}
{"Author": "John Graf", "Date": "August 7, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Options.</span> There needs to be away to set multiple on and off timers and dim level on each  timer.. It is to difficult to set up scenes."}
{"Author": "Luisa Marieth Morales", "Date": "September 14, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Unreliable</span> The new app was automatically downloaded and now nothing works. Had to unplug all devices so I could turn my lights on. Honestly, this product has been one hassle over another. Never should've bought it."}
{"Author": "Alicia Kellogg", "Date": "September 27, 2015", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">This sucks</span> App won't even open on my phone. What a bummer!"}
{"Author": "John Chaney", "Date": "September 18, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Android App does not work</span> This app used to work. Now it won't even open. Did you stop supporting this app?"}
{"Author": "Ivars X", "Date": "September 15, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Crapware</span> Previous version worked on my Galaxy S4. This update bombs on opening."}
{"Author": "Jeff Garrett", "Date": "August 23, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Fixed icons</span> After a couple updates and a few months scene icons finally are saved."}
{"Author": "Harold Juan Pablo Castro", "Date": "August 8, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Compared to iOS, it's so fugly!"}
{"Author": "Mahalia J. Druhot", "Date": "April 20, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">alerts just vibrate, no sound</span> i hate the new alert system! It would be fine if it actually alerted me, but it just vibrates with no way to change it. UGH!!"}
{"Author": "Scott Kieley", "Date": "June 18, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Shame on you Insteon!</span> I have to force close this every time I use it. Only getting one star because I can't rate it zero stars."}
{"Author": "mike strauman", "Date": "August 21, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Broken after last update</span> Status indicators wrong colors after update. Annoying notification noise added to push notifications."}
{"Author": "Heather Fontanetta", "Date": "August 12, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Update is horrible</span> Since the update I cannot change the volume or sound when an alert comes in."}
{"Author": "Alex Rico", "Date": "April 14, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Cameras still don't work as of 4/14 update</span> The cameras haven't worked since the last few releases. Note4 on Android 5.0.1 if your paying attention"}
{"Author": "Phil Denette", "Date": "April 26, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Was working fine.</span> Something to be said if it is not broken don't fix it. Was working just fine until the last 3 updates now camera does not display video and schedules on lights messed up. Awsome."}
{"Author": "Chris Bowers", "Date": "July 22, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Buggy</span> Camera is a little slow and the sound only work sometimes. Needs more features for devices that you can control. It's a little bit plane."}
{"Author": "Jared Bevis", "Date": "July 25, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">\"Crashes\" back to Insteon room tab</span> If I dont force close the app every 12-24 hours, it refreshes back to insteon room tab as soon as I try to open a scene or device."}
{"Author": "Rommel Jadotte", "Date": "August 1, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Insteon needs new management that cares for their customers.  The hub is 1% smart, it works great but requires your brain to make things happen.  1% is just a simple scheduling timer.      The hub does what it supposed to do when we tell it, so it not a hardware issue, it needs better software with some commonsense (AI).    If your current team doesn't have the skills to add some AI functions, please do this: fix the app so it can work in landscape mode.  (so simple to do).  If you can display vertically so how hard can it be to make it horizontal.     Too bad I cannot give your SW a zero  rating even  your HW deserve a 10.  Your bad rating is doing way better than  a simple app that can only display \"hello world\".   Your app is free, so you are not making any money from it . Commonsense, without a great app , no one will want to buy your HUB"}
{"Author": "Adriano Baglioni", "Date": "April 16, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Works ok, although not very intuitive</span> The app controls devices, shows sensor states, and let's you set up schedules.  Works fine,  but setup is not very intuitive."}
{"Author": "L Lan", "Date": "April 15, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Still won't work</span> Latest update still didn't fix it.   Still won't work with my WiFi."}
{"Author": "Juha Sirkka", "Date": "May 11, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Full of problems</span> Other Insteon products seem good but this Android app is just full of problems. I had to borrow an iPad to set up my system and I only have a couple of light switches set on schedule. Insteon really needs to ramp up on the Android app side to make the hub successful. Currently I consider this app unusable."}
{"Author": "Michelle Merryweather", "Date": "August 16, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">2 way talk?</span> Thought the camera is a 2 way talk. But the app doesn't support that? Not sure I want the camera if that is the case"}
{"Author": "Jeff Camp", "Date": "April 14, 2015", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Great System</span> Update 2 -  Update 4/14 has not fixed push notification sound.  Still just vibrates.  Update 1 - Have noted with the introduction of push alerts my Motorola MAXX running 4.4.4. alerts OK but with only a vibration, no sound.  Sound would be nice too.  Please fix.    Other than that, complete Insteon system works with app very well.  No complaints."}
{"Author": "Grant Emsley", "Date": "May 27, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Remember my password</span> Constantly get kicked out and have to reenter my password.  Sometimes it stays logged in.  Other times it logs i  automatically.  But 50% of the time I have to put in my password again."}
{"Author": "Kamron Lessani", "Date": "July 20, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Normally ok app</span> But it's not working today,  win 8 app works.  Anyone else having trouble?"}
{"Author": "Jim Pawlak", "Date": "July 21, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">This Dog Doo Doo</span> Very Very Difficult to do simple home automation tasks like daily/weekly program a device such as the ON/OFF MODULE."}
{"Author": "Robb Wilson", "Date": "June 25, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Doesn't connect</span> Using the Samsung Galaxy note 4. Won't recognize and kicks you out"}
{"Author": "Tamara L", "Date": "July 14, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Camera not working</span> The camera will not load a picture on my Samsung galaxy S4.  The camera works perfectly fine on the apple Iphone.  Please get a fix for this issue !!!"}
{"Author": "Brent Moore", "Date": "April 21, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">No support for Android</span> They favor Crapples not Android. Now available on Apple watch, but I STILL can't open my garage door with my Android?"}
{"Author": "Dick Bipes", "Date": "August 4, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Annoying sign in</span> This app mostly works, but keeps reverting to the log in screen. I learned to just press the back button rather than log in again, but there is a 10 second delay to \"connect\" to my hub. Annoying."}
{"Author": "Doug Mckinney", "Date": "July 9, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Android user</span> Cannot add 2nd house on same account. You have to change default email settings to point app to hub you need to see. That's a pain. Not convenient at all."}
{"Author": "Teagan Glenn", "Date": "July 25, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">It sorta works...</span> The UI is super clunky, and very dated looking. I added a scene and am unable to delete/edit it. So disappointed..."}
{"Author": "John Paquette", "Date": "June 19, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Works consistently</span> I use it with insteon bulbs and a few other switches to control my lights through out my home.   Yes the android app could use some work."}
{"Author": "Jeremy Brown", "Date": "June 11, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Was good!</span> Previous versions were great. This time around I'm have little luck. The app won't let me select anything.  Every time I tap to select an item the screen refreshes and goes back to the scene page."}
{"Author": "CLIFNOTE DL", "Date": "May 7, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Scene Buttons</span> The buttons under the scene page default to the power icon after customizing each scene with a specific Icon every time accessing the Insteon for Hub app.  Why is that? Didn't do that in the precious revisions."}
{"Author": "Larry Wright", "Date": "April 14, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Notifications</span> Need a way to turn Off notifications on specific devices.  Example I have the app installed on 4 devices, I only want notifications Only on 1 device, not on all 4..."}
{"Author": "John Graf", "Date": "August 7, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Options.</span> There needs to be away to set multiple on and off timers and dim level on each  timer.. It is to difficult to set up scenes."}
{"Author": "Allen Foote", "Date": "April 15, 2015", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Cam</span> Cameras finally work now, PLEASE BEFORE U ALLOW SOME I.T. GURU TO MAKE AN UPDATE HAVE A 2ND SET OF EYES TO ENSURE HE OR SHE DIDN'T MESS IT UP.....sincerely 1000's of customers.   :)"}
{"Author": "Jessica Thornton", "Date": "June 13, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Needs some updates</span> I enjoy this app because I can watch my dogs when I'm not home as I run a dog rescue and always worry however I really wish the microphone option would work on the app like on the computer and a way to have the visitors sign in so I don't have to give people my password to watch when I'm caring for one of their dogs so I can change it when they leave also make the app look more Profesional I'm happy to use it but it does disconnect from my cameras at times and then randomly works again I think it needs work"}
{"Author": "John Warcup", "Date": "April 14, 2015", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Camera works again</span> Camera fixed after latest update and now works on wifi.  App seems faster overall.  Would still like fewer taps just tor turn on a light."}
{"Author": "Bro Bec", "Date": "May 23, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">You just lost money</span> Returning everything I just bought because they failed with this app.  It was the main reason I bought all of the insteon products... connectivity. $400 of stuff back on the shelves and money back in my wallet."}
{"Author": "Adam monteza", "Date": "June 21, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Nice idea but buggy</span> They messed it up. Scene buttons lose the selected icons and go back to default switch icon. Support does not respond to that complaint. That problem does not exist e.g. in the iPad version of that app."}
{"Author": "", "Date": "May 4, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Even with new hub, app is terrible</span> Where to start? The UX is dreadful. Icons that get reset to default, no customization, tiny controls. The app will never stay connected to the hub without having to login all over again. Bear in mind, I've owned the 2012 and 2014 hubs. There's clearly no real money being put into the app as part of an automation solution. My advice to other insteon users is stick with hardware and don't waste time with this frustrating and very rudimentary app."}
{"Author": "Jocelyn Kidd", "Date": "April 29, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Terrible</span> Lots of glitches. Back tracks or opens new pages without me touching anything. .. I'll try to check on a device and it will force me into something else. Also my first device from insteon was defective. ..app isn't much better. Should have went with z wave."}
{"Author": "Russ Waller", "Date": "July 29, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Thermostat functionally</span> The app will not display the temperature if both the A/C and heat are turned off. If you turn either of these functions on, it will then report the temperature, which is a waste if I simply just want to check and not actually adjust. The Windows app displays the temperature just fine. Please fix this."}
{"Author": "Daniel Ungerleider", "Date": "July 3, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Extremely slow</span> Takes forever to load Insteon IP Cameras.  Third party apps load in a fraction of the time."}
{"Author": "Anton Wilpernig", "Date": "July 19, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Scenes - cannot add devices !!</span> Have installed the latest version on my Samsung S5. Can control switches manually, but when setting up a scene, it does not give me a button or function to add any devices. With that the Scene function is useless. Another shortcoming is that Sunrise or Sunset function does not have a +/- xx minutes function like in the 10 year old X10 controller. All in all  the add is mediocre and not ready for prime time!"}
{"Author": "Anthony Genovese", "Date": "July 16, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Schedules do not work</span> Set a schedule on a scene with 2 plug ins, it turns on fine but doesn't turn off."}
{"Author": "Sorabh Mishra", "Date": "April 12, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">I like it</span> The biggest issue is that I am colorblind and can't tell the difference between the yellow and green"}
{"Author": "Sean Wohltman", "Date": "March 24, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Spent too much for app to be this bad</span> I've probably spent $3k on insteon products. Too much considering how bad and unreliable this app is. Using the HUB 2.0 and have tried on both an HTC M8 and a Nexus 6. Same issues. Schedules with Dusk/Dawn have never worked with the Hub 2 and they haven't done a thing. No DST support and hub always thinks you're in LA. Also the following behavior occurs. 1) sign into app, everything works great. 2) Leave app running in background or come back a few hours later and app requires a force close to work again."}
{"Author": "", "Date": "July 21, 2015", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Great Free App</span> This app works great for me I can control my air conditioning, my heating and all my lights in my shops, just perfect, easy setup too. highly recommended"}
{"Author": "Tab Hargraves", "Date": "March 28, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">3.28 update broke thermostat</span> Today an update installed on my s5, lollipop 5.0 and now my thermostat won't provide info or let me set it.  Now I have to drive one hour to check on cottage and their help phone number isn't working. Terrible terrible terrible"}
{"Author": "Rich Hyde", "Date": "April 13, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Doesn't see my insteon light switches"}
{"Author": "Matt Chalfin", "Date": "June 27, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Doesn't work"}
{"Author": "Jeff Biles", "Date": "March 27, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Terrible Update *Edited* after Hot fix</span> *Update: Hot fix seems to have resolved the Location issue. Adding stats back for quick response/fix.  Edit Settings &amp;gt; House &amp;gt; Location crashes app everytime on Android 4.4.4.  Location always shows \"Los Angeles, CA.  Please fix!!! The App should not keep getting worse with each \"update\". Terrible app development."}
{"Author": "Jordan R", "Date": "April 5, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Still can't make it right</span> I don't know what Apple does with their app but it works flawlessly compared to this! I can change the heat NO PROBLEM on an iPhone 4..but try and do that from an S4! Junk! Perhaps I'll try the nest integration...cant work any less. CAMERAS SUCK AFTER UPDATE!! STILL CANT CONTROL THERMOSTAT! IPHONE app got it right..."}
{"Author": "mark d", "Date": "March 23, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Does not work</span> I have connected the Insteon to a neon/fluro light. Now every time I turn on any other light in the house the neon flutters on and off several times then stay on. Sometime later, the system then turns itself off even though I have touched nothing. Totally useless system"}
{"Author": "Tischa White", "Date": "April 5, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Can't locate my hub</span> I purchased 2 cameras I'm trying to set up one and it keeps saying hub not found I plugged the plug to wall outlet as instructed I can't even get past this part."}
{"Author": "Keith Perkins", "Date": "March 22, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Don't upgrade to this version!</span> Unfortunately I had this app on automatic update, and the latest version is horrible!  Two of my IP cameras take 20 seconds to appear, and the third never appears anymore.  However, on my Ipad version of the app, all the cameras show up instantly.  Trying to figure out how to roll back to the previous version.  Insteon...please fix!!!!"}
{"Author": "John Schuler", "Date": "March 26, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Crap</span> Never was able to get the Insteon system to work.  It's just sitting in a box. I'm going to give it to Goodwill."}
{"Author": "J Russillio", "Date": "June 12, 2015", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Love It!!!"}
{"Author": "Abdullah Al-Salloum", "Date": "July 6, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Almost Perfect</span> Stable, reliable and secure. Two features missing: (1) Google Voice integration, and (2) Widget Toggles. Good job guys."}
{"Author": "Beverly Howard", "Date": "March 26, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Barely Usable</span> This app's interface is worse than X10 controller apps written 20-30 years ago.  Sometimes the devices respond... other times they don't.  This is an orphaned part of the home automation equation that looks like insteon's management does not understand and does not support.  The most recent update broke sundown schedules that were dead on until the update and now they are an hour off.  Go in to try to just verify the location and the app crashes.  App's free... but the expensive device it is supposed to work with is essentially useless due to lack of support."}
{"Author": "Jill Sobol", "Date": "July 21, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Does not work consistently on Droid devices"}
{"Author": "Roger Thompson", "Date": "March 29, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Beta for a reason</span> Tried latest version,  now it can't find my hub and no way to change configuration until after you login. Why it requires an external server connection is a major security issue.  Would not trust this program for home use.  Certainly not software to trust your home with."}
{"Author": "Mike Niese", "Date": "July 21, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Junk</span> Push notifications don't work"}
{"Author": "Brandon Migliore", "Date": "July 15, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Little buggy, but useful.</span> Widgets would be fantastic. Let's utilize our Android features!"}
{"Author": "Glenn Engstrom", "Date": "March 28, 2015", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">So easy to use</span> I use Insteon and X10 devices. This makes it easy to schedule the device actions."}
{"Author": "Jeremy Ball", "Date": "March 30, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Update camera does not load when on my own WiFi. Works everywhere else just fine."}
{"Author": "kevin mathiasen", "Date": "April 9, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Crashes</span> I would rate 0 if I could."}
{"Author": "Pat Patterson", "Date": "March 30, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Update had problems</span> After update camera only displays video if phone is on 4G or WiFi other than home network."}
{"Author": "Neal & Lisa Quigley", "Date": "March 23, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Location Changes Closes App</span> I have been trying to get the App to recognize Daylight Savings, turning the Observe DST feature on or off has no effect on the Hub Time, even thought there is a note saying the Hub Time is being updated.  Tried changing the Location of the Hub to change the time and the App crashes?   Also, can't get the Scenes to work at all, would like 2 different light to come on at the same time, shouldn''t be that tough by creating a Scene.  But no joy..."}
{"Author": "Kevin Kubacki", "Date": "April 4, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Update is awful. 4/1 update still does not work."}
{"Author": "Chris Wigley", "Date": "July 23, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Horribly slow qw home automation is way better"}
{"Author": "Brandon Beller", "Date": "April 6, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Sucks</span> This app hasn't gotten any better over the past 2 years...since the last update my cameras over 4g dont connect...they just keep loading and loading. I was told by insteon they are aware of the problem and a new update is coming 4/4...guess not..im going to buy an iphone today because of this crap!  It could be fixed tomorrow or a month from now.  Either way i payed alot of money for this equipment and expect to be able to use it....not good insteon not good"}
{"Author": "", "Date": "March 21, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Camera takes longer to load (if at all)</span> App is good. Latest update definitely had adverse effects on IP cameras as it takes much longer to display if at all. I can pull the same camera up in a different app instantly."}
{"Author": "Wilson Alavarez", "Date": "March 30, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Not open htc m8</span> The app dont open."}
{"Author": "curtis taylor", "Date": "April 9, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Garbage</span> It won't connect to my phone which is why I got it!! What's the point of having a camera that won't record and won't connect to your phone"}
{"Author": "Damian Dabrowski", "Date": "March 28, 2015", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Best system</span> I've tried different ones and this is by far best out there so reliable so easy to use and fast in response I just love it keep up the good work."}
{"Author": "Larry Wright", "Date": "April 14, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Notifications</span> Need a way to turn Off notifications on specific devices.  Example I have the app installed on 4 devices, I only want notifications Only on 1 device, not on all 4..."}
{"Author": "fadi Handal", "Date": "May 7, 2015", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Works great</span> Works well. it would be nice to have more options, But seems to do what it claims"}
{"Author": "Keiko Lee", "Date": "April 5, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">No work</span> I just purchased the camera and it doesn't work on wifi. This app doesn't help me set up. Uninstall"}
{"Author": "ferrariflat12", "Date": "May 23, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Cameras?</span> Would be OK if they hadn't killed the local  camera support in their latest updates. Was working great ... why the \"fix\"?"}
{"Author": "Benjamin Ning", "Date": "March 30, 2015", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Faster !</span> Connect the hub and devices much faster than before. Great update !"}
{"Author": "", "Date": "March 25, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Last update ruined ability to see cameras</span> Now when I try and use the cameras on the wifi at my house, it doesn't work at all. I have to shut the wifi off and use the data on my cell phone plan. This is costing me $$$ please fix!!!!"}
{"Author": "Tadeusz Toporkiewicz", "Date": "May 14, 2015", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Connect ed and works in no time"}
{"Author": "Jessica Donner", "Date": "April 10, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Cameras won't work after latest update.  Very disappointed."}
{"Author": "Ashur Samuel", "Date": "March 27, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Last update affects negative on camera</span> The camera takes a lot of time to show the picture. Before the update was pretty fast."}
{"Author": "Steve Kearns", "Date": "February 7, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Not working anymore</span> Don't like the fact that I have to sign in almost everyone i want to use it. Now today it won't connect to the hub. Not sure I'll waste any more money on this system"}
{"Author": "Richard Pavy", "Date": "February 17, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Missing important features</span> Does not support the bottom plug of the dual outlet 2663-222. Needs to reconnect to the hub all the time."}
{"Author": "Damon Hall", "Date": "March 5, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Wasted money</span> Literally threw my money in the trash.  Cant even connect to my new hub.  I can now see why it was on sale."}
{"Author": "Joshua Warfel", "Date": "January 4, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Getting better</span> True \"Works with Nest\" support was finally added to the latest release, and it actually works now. However, still cannot add Nest thermostats to scenes, so the whole reason for adding it to the app is mute. I want true home automation, meaning pressing a single away button and having my lights turn off, doors lock, and temperature set back. Please add Nest support to scenes in the app."}
{"Author": "Jeremy Thomas", "Date": "January 7, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Does what it says."}
{"Author": "Craig Dannenberg", "Date": "March 2, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">If Rube Goldberg had designed apps.......</span> Insteon must farm their application development out to people who aren't insteon users themselves. Granted, insteon systems are designed to work mainly with keypads and other physical controllers, but it sure would be nice if the apps would at least somewhat mimic the ease of pushing a single button, to enable a scene. The nonsensical, overly complicated apps that they've churned out for Windows and Android are inexcusable."}
{"Author": "James Wood", "Date": "February 1, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Works good</span> Needs to support bottom plug on the 2663-222 outlet."}
{"Author": "Greg Pendleton", "Date": "March 17, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">The UI is horrible</span> The back button doesn't stop at a home screen, but just replicates the android back button. The edit button, when active is not as useful as it could be, a long press action would be far more effective for most uses. The labels could be more useful: what is check-in? And the help option, if you can find it, is little more than a broken browser rendering."}
{"Author": "Mike O'Brien", "Date": "February 15, 2015", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Cool product</span> Great way to keep track of the house while we are away."}
{"Author": "karen singh", "Date": "February 14, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Can't  complete the set up unknown error message keep coming up. Will return the camera uslesss"}
{"Author": "Casey Reed", "Date": "January 5, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Good but unfinished</span> I have had very little trouble with the insteon app but I find myself wanting more. If this app had widgets or the ability to have guest accounts that you could set access to certain devices it would be absolutely perfect. I would rather pay a monthly fee and have a few extra features but for being free it is a solid app"}
{"Author": "TODD CRUTCHFIELD", "Date": "March 1, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Some difficulty</span> Took me quite a while to set up but app does need some improvements"}
{"Author": "Steven Kaufman", "Date": "January 18, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Terrible...still</span> Doesn't connect to hub unless on wifi. Rarely even then. No customer service... nothing working, except Costco returns. Junk."}
{"Author": "Bob Miller", "Date": "February 9, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Needs work</span> Hub does not always connect properly.Have to refresh several times to get the devices all to show their current status properly.Also a major bug is the \"Hub Time\" does not show at all on any of my Android devices (4).Therefore, if you try to set a schedule for any device, it doesn't activate at all because there is no Hub Time for it to activate off of.I also have a iPhone.That software does show the \"Hub Time\"and you are able to set a schedule that actually will work or activate when it should.Needs a fix!"}
{"Author": "Matt Klaustermeier", "Date": "January 5, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Getting better</span> I'm glad to see this app continue to improve. My favorite feature is that it takes advantage of the scenes in the hub, removing the need to manually program the devices or use the somewhat buggy HouseLinc PC software."}
{"Author": "Jon Fahrner", "Date": "March 22, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Recent update broke camera functionality. Please fix!"}
{"Author": "Stuart Whitmore", "Date": "February 18, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Badly in need of UI overhaul</span> The usability of this app is atrocious. Please, if you're paying attention to reviews at all, get a proper UX/UI team onto a complete rewrite. The Insteon system itself has enough issues as it is, but the app -- the center of the \"mobile control\" marketing -- would make me regret my Insteon purchase even if everything else worked perfectly."}
{"Author": "Brion Nelson", "Date": "January 27, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Decent application</span> For the most part, the app does its job. However;  the lack of two way audio with the camera is not ok.  I shouldn't have to use a separate app from a 3rd party to get more control than the makers app. IPcam Viewer does so much more."}
{"Author": "Wayne Chatham", "Date": "January 3, 2015", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Please add Nest support.</span> Your iOS version of the app supports Nest thermostats. The Android version hasn't been updated in almost a year. UPDATE: even after the most recent update Nest support still does not work. Entering credentials and the app just hangs. Works from an iPhone just fine so I know my credentials are correct. UPDATE: looks like Nest integration is working after the latest update. Thank you for fixing."}
{"Author": "Bill wade", "Date": "January 9, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Use on lights in theater</span> When using scenes in theater the scene button should be one click and done. As it is you hit scene button and it brings up a button that looks like the dimmer switch that you have to click to turn scene on or off. Click not click click would be better."}
{"Author": "Mike Shaver", "Date": "March 26, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Do not upgrade</span> Version 1.7.3 is brutal.  Cameras are super slow to load on wifi if they do at all. Won't load cameras over cellular connection at all.  Terrible update and everyone needs a way to roll back to something that works... Not great Insteon..."}
{"Author": "Jeff Baldwin", "Date": "March 21, 2015", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Insteon nailed this one! Love the products and app.</span> Insteon for Hub"}
{"Author": "Joel Carter", "Date": "January 3, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Update was much needed</span> The last 2 months or so I have not been able to connect to hub. This update fixed thar as well as my Nest! Many thanks! Can't give it 5 stars due to the old style interface and confusing scene and device configuration.   App desperately needs a facelift and added support to use phone mic with the cameras."}
{"Author": "mell rosandich", "Date": "January 24, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Timeout issues.</span> I have a galaxy s5. When I turn on a light it works. If I come back 2 hours later the app takes forever to find the hub. If I force it to stop it works instantly. Please fix the tcp socket issue. Also make a widget for favorite items or better yet do what smart remote did and have it available on the login screen. Don't make me make a new app for this hub :)"}
{"Author": "Geoff Peacock", "Date": "January 6, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Alpha release at best.</span> Timers don't work. Setting up cameras is a joke. It can turn off lights though. I have yet to get it to dim one though."}
{"Author": "Trevor Cornell", "Date": "January 28, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Not quick</span> Turning off a light has never taken me longer than it has with this application. After waking my phone or tablet, the application has to be killed and restarted in order to reconnect to hub, else it continuously cycles back to the home screen whenever a device is selected. A simple on/off switch has turned into half a minute of touch screen mayhem.  I found it confusing that using the back button signs me out of the hub. I actually can't think of a time when I would ever want to sign out.  Editing information isn't intuitive. There is a context-sensitive edit button on the bottom that allows scene, device, and room editing, but getting into the right context is a bit confusing. I'd rather have a single menu that displays \"edit devices\", \"edit room\" and \"edit scene\" rather having to remember that I have to be in the Room menu and \"Edit This\" to change device properties.  It's just not quite doing it for me."}
{"Author": "Mike O", "Date": "January 25, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Craptastic!</span> Been using iSmartenIt with a Pi and Insteon USB PLM which has been decent but lacking in scene support. Bought the Hub2 to give it a whirl with the Insteon app and I can now see how horrible this is! Scene support works but connecting to the Hub reliably is wretched. iSmartenIt easily outperforms and has most of the same functionality.  Okay, root of the problem and this should *REALLY* be addressed, cloud connection is a requirement. This causes performance lag and keeps you from being able to use it without an Internet connection. PLEASE PLEASE fix this and enable local modification of the Hub2 *without* the cloud service."}
{"Author": "Mark Nacke", "Date": "January 19, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">User interface is bad</span> This app is slow and looks like it was designed by pre-school kids. Each time you start the app it takes a minute or better to go through sign-in and come up with the display. Another annoyance is there no way to close the app without back stepping through all of the screens."}
{"Author": "Mighty Joe", "Date": "January 16, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">CANT CREATE!!!</span> Wont let me create an account or use an existing one"}
{"Author": "Neil Rollins", "Date": "March 22, 2015", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Last update fixed my Samsung thermostat issues!  Thank you, all is working great now!"}
{"Author": "Chris G", "Date": "March 14, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> This mess is not just simple. Bought a camera now I downloaded the app and it can't find it. Do I need to buy the hub unit also because the box didn't say it needed extra equipment"}
{"Author": "", "Date": "March 25, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Last update ruined ability to see cameras</span> Now when I try and use the cameras on the wifi at my house, it doesn't work at all. I have to shut the wifi off and use the data on my cell phone plan. This is costing me $$$ please fix!!!!"}
{"Author": "Tyson Bekker", "Date": "February 24, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Does not work anymore.</span> Worked alright for awhile. After last update does not work. Once it starts working again I would give 4 star"}
{"Author": "Jeff Szymczak", "Date": "March 1, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Never Fully Functions Properly</span> Every time the app updates, I lose functionality on one/multiple devices. Garage door no longer works and now I can't pan, tilt or zoom the WiFi camera from my phone. Had kitkat OS and now have lollipop and still won't work. I have given up on Insteon products from now on. Will miss the friendly tech support. It's too bad that I've had to utilize them as much as I did for products that are supposed to be \"easy to install\"."}
{"Author": "Mark Tiesman", "Date": "January 5, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Pretty good, some quirks</span> Overall happy with my Insteon setup. App works as should MOST of the time. Sometimes when the app is running in background and accessed again it has trouble trying to reestablish with the hub. Have to hard close the app and restart it."}
{"Author": "Dan Cregg", "Date": "April 26, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\"></span> I use both the iOS and Android versions of this app, although the Android version lags behind the iOS in features, I actually like it a bit better.  My experience has been stable, no crashes on my Nexus 5, and very easy to use.  I don't agree with other's posts of 1 star due to not supporting Android Wear..."}
{"Author": "Hans Mertens", "Date": "March 2, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Pretty terrible and poor IT support.</span> I tried to add the outdoor wifi camera to the hub and everything went to crap. Now nothing works for me and every time I try and login to the hub it fails to connect. Now I have  $400 worth of INSTEON gear that doesn't work. Garbage."}
{"Author": "dn dp", "Date": "January 10, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Trouble turn on off light</span> Work before, but after update kinda buggy"}
{"Author": "Gustavo Chuc", "Date": "January 8, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Nice"}
{"Author": "Michel Talbot", "Date": "February 25, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">going backward</span> not able to modify a \"single\" unit in a  scene. when building a scene have to \"travel\" thru the house for pressing on each set button. tried to add a Smarthome camera and each time it simply screw up the config in my camera where I have to restart from scratch  previous version for windows was sooo simple to manipulate"}
{"Author": "Allen House", "Date": "December 20, 2014", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Crashes</span> Crashes when in vicinity of home network and wireless cell. Then is hard to reconnect to hub."}
{"Author": "john kitscha", "Date": "December 25, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Junk,  Doesn't work</span> I would rate it ZERO starrs if I could.  The App can't even connect to the Internet to find the hub. This thing sucks"}
{"Author": "Fred Johnston", "Date": "October 31, 2014", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Hello?</span> After ALL this time,  and NOW it has 'beta'  plastered on it lol?  Thermostat no longer displays humidity, and more icons COULD fit on each page. Please pay SOME attention to us Android users!"}
{"Author": "Aaron Hodge", "Date": "January 3, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">I hope the exciting news is....</span> A complete rewrite of this App!!"}
{"Author": "Robert Huebner", "Date": "December 22, 2014", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Wish it worked from my Lenovo Yoga</span> Have used this app on my moto X ... and it is not bad, WiFi works good, cell is slow and spotty. On my Lenovo Yoga hd+ it will not even start up ... Please fix"}
{"Author": "Evan Kent", "Date": "October 22, 2014", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Wish I could create a widget for my home screen to turn on one light without having to open the app"}
{"Author": "Dylan Trafford", "Date": "December 25, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Completely Unusable</span> On a Droid RAZR Max HD. Both myself and my family have the same phones and none of our phones can make it past the \"Cannot find the internet page\". We can use other software on our PC to operate the insteon system but the app is a no go with almost nonexistent documentation for setup troubleshooting.   I would try on other devices but is not supported on my Galaxy Tab 4. What is the point of even paying for a $100+ hub if the app is so broken you cannot connect?"}
{"Author": "Michael Sheffer", "Date": "January 7, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Update is a huge improvement</span> Past version was awful."}
{"Author": "Rabid Hampster", "Date": "October 31, 2014", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Fix</span> Its broken since the last update, it locks up every time I go into the all devices tab and favorites are gone. I will bring up the rating here once it is fixed"}
{"Author": "Cary Dodenhoff", "Date": "December 24, 2014", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Expected much, much more from 5th attempt</span> After serial interface, usb, Ethernet, first hub and now this hub you'd think the inventors could get it perfect. This software/hardware is being sold in stores now, but it's in BETA!  Usually proprietary hardware with OEM software results in a dependable, backward compatible, clearly documented and well supported solution.  After 10 years of buying insteon, I can assure this is not NOT THE CASE HERE!  Missing scheduling offsets to sunrise and sunset. Missing \"IF THIS THEN THAT logic.\"  Missing ability to a"}
{"Author": "Rod Simon", "Date": "December 14, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Issues conecting</span> In addition does not work with my android tablet"}
{"Author": "Orlanzo Ross", "Date": "November 8, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Doesn't Disclose Why Permissions Are Needed</span> This is a useful app, but there is a major problem.  It requests a large number of permissions and doesn't explain why it needs them.  Misuse of data ad privacy are significant concerns.  Some uses are obvious while others are not.  The developer should clearly state why it requests the permissions it claims to need."}
{"Author": "Stanley Gallery", "Date": "October 30, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Disaster app</span> Intermittent and undependable at best.  Take a pass on any instion product or app!"}
{"Author": "", "Date": "December 26, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Useless</span> App is unable to connect to whatever it needs from the internet. Failed on S3 and acer tablet.  Without it the hardware is doing nothing but sitting in a box."}
{"Author": "Jim Mannion", "Date": "December 26, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Not ready for primetime</span> Too many issues to document now. Definitely not user friendly"}
{"Author": "Tony Sullivan", "Date": "December 10, 2014", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Meh</span> Buggy and kludgy."}
{"Author": "Michael Freeman", "Date": "January 3, 2015", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Insteon</span> Works well"}
{"Author": "Wanda Parr", "Date": "December 22, 2014", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">I dig it!</span> Simple to use and easy to navigate. Highly recommend :-)"}
{"Author": "Bruce Hunter", "Date": "October 21, 2014", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Control of your home from almost anywhere.</span> Great application."}
{"Author": "Jason McIlrath", "Date": "December 13, 2014", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Little buggy</span> Keeps looping as you click a item taking you back to the previous item. LG G2"}
{"Author": "Danny Di Buono", "Date": "November 21, 2014", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Works exactly as it should</span> Works exactly as it should. I’m amazed at how people has posted such bad reviews. I think it is all the User, not the device. Of course the HUB is not perfect, nor the App, and Insteon is working on fixing issues and adding more features, but please, do not post bad things if you don’t know what you are doing. I have the HUB Model #2242-232 (is new and not listed yet on the Insteon site). I have the Android App installed on an HTC EVO 4G LTE phone and on an Acer Iconia Tab A500 tablet, and also the iOS App"}
{"Author": "Greg Smalley", "Date": "December 26, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Doesn't work on MotoX.  IPhone version works fine."}
{"Author": "Sterling C. Poteat, III", "Date": "December 27, 2014", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">What a Worthless App</span> This app is worthless.  This app is not reliable.  I have to re-login every time I need to turn on or off the lights to ensure that the app is actually connected.  There is no ability to send alerts when a device is triggered, as described in the feature list.  Also, I cannot create a sunrise/sunset schedule for individual devices.  I have to group them together as a scene and trigger the scene.  If one needs an app to control their devices, use Tasker and Direct Commands."}
{"Author": "Prashant Phatak", "Date": "December 7, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Not good</span> I love insteon and for yrs i had a PowerLine usb control i used w qwhomeautomation.  This app is slow to refresh, very slow to login as it authenticates and connects....up to 30 seconds! Please speed this up! Or hub is going back.  Also i prefer a list view as i have 30 devices and large icons and multiple pages not helpful.  Also takes too long for device to refresh each lights status.  Sometimes  wrong light turns on w scheduler and sunset and sunrise don't work. To get nest working I had to use an ipad."}
{"Author": "Damir Boksic", "Date": "November 5, 2014", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Maybe sounds rough but this is amateur work</span> Simply: so much things are missing and those one that are there are bad! Developers should try real Smarthome system like Fibaro, Homeseer or similar, to see how much they should raise their standards and way of thinking..."}
{"Author": "Geoff Peacock", "Date": "January 6, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Alpha release at best.</span> Timers don't work. Setting up cameras is a joke. It can turn off lights though. I have yet to get it to dim one though."}
{"Author": "Brad Hubbard", "Date": "October 22, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Disappointing afterthought</span> It does not look like Insteon took this even remotely seriously. I've had my hub for almost a year and continue to be disappointed by the app. Sloppy UI, lack of widget support, seems like it is just a bad port of the iOS app."}
{"Author": "Jennifer Hardy", "Date": "November 3, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Used to work ok</span> Please fix this crap! I'm getting so annoyed with it working whenever it wants to. Half the time it won't load."}
{"Author": "dean krontz", "Date": "October 24, 2014", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Works Great</span> Got this app and works with my hub, two lamp controllers, two thermostats, fire place controller, ceiling fan controller. Not sure why others are rating app so poorly. I have installed this app on an iphone and Android. Set up multiple scene controls and can get email notification from my insteon camera on alerts."}
{"Author": "Trey G", "Date": "December 29, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Doesn't even pan or tilt my wifi cameras like it saya</span> This app is horrible. Will be returning the system. I wouldn't recommend insteon products to anyone. I can't control devices away from home. I don't receive notifications from door sensors or water leak sensors. Totally pointless, total waste of money. The app is so horrible... This experience with insteon products have left me so frustrated and upset. I can't believe that someone would sell junk and crap like this."}
{"Author": "Joe Goldade", "Date": "December 9, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Can't create an account</span> I can't even use this at all because it fails to let me create an account.  Tried both this Android app and iOS app.  C'mon!  Fix this."}
{"Author": "Casey Persson", "Date": "December 11, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Disappointing</span> I have been using the insteon app and hub for about 5 months now.  When I first got the kit, it was glitchy and slow.  After I wrote a bad review on here it did get a lot better.  Over the last two months or so it has gotten worst.  The app can't ever connect to the device even when right next to it.  Unplugging the hub then plugging back in worked for a while but even that is not resetting it.  Also, this technology doesn't let me turn lights on/off while away from the hub.  Big mistake, in buying."}
{"Author": "Tad Luedtke", "Date": "January 5, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Data hog</span> I spent most of the weekend setting up my house with the various pieces that I had purchased and tried to give the benefit of the doubt with this app that looks awful and works even worse. And then it used over 2 gigs of BACKGROUD data in less than 8 hours! I am uninstalling this joke immediately and returning all the hardware tomorrow."}
{"Author": "Glenn Walters", "Date": "January 4, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">App makes hardware useless</span> Before the update this app worked about 75% of the time.  Now, I can't connect at all.  Repeated set up, tried everything and no luck.  Insteon is taking a beating and this app may be the last nail in the coffin.  I'm going to write the whole starter pack, etc. off as a failed experiment."}
{"Author": "", "Date": "October 4, 2014", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Not good security system</span> Make app better with arm/disarm option... this app is BS... and you cannot setup notifications... why actual app notify that something is happening not that I get msg and email each time when I open or close the door... or walk next to sensor. You guys have great product but your app is not good at all... hire new software development team... regards..."}
{"Author": "Don Erichsen", "Date": "November 2, 2014", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\"></span> This app is okay,  but it does have bugs. I just installed it on a Galaxy S5.  Numerous times the devices can not be controlled.  Only by rebooting the phone as the issue been resolved. Please make an update  available."}
{"Author": "Steve Scott", "Date": "October 23, 2014", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> This latest update wont install ! (Package file is invalid)"}
{"Author": "Chris Hume", "Date": "December 14, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Constantly crashes.</span> Barely works. I have to use iOS version to get everything working properly. Need to kill the app any time I switch tasks. Very much a beta app. Please work on this since you force everything onto the phone with the latest insteon hub (advanced PC software won't connect to this)"}
{"Author": "Lew Heifner", "Date": "January 4, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Thermostat</span> Still cannot control the thermostat settings."}
{"Author": "Trixer Bautista", "Date": "December 23, 2014", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Working but not great</span> Insteon supports burglary. Why theres no arm and disarm option,"}
{"Author": "Jacob Flanagan", "Date": "June 5, 2014", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Its Okay...</span> I hope to see some improvements in the future, but for now an option to change the color scheme, swippable categories, and most of all an ability to change orientation would make this a LOT better."}
{"Author": "Alex Harcourt", "Date": "January 6, 2014", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Needs Widget!</span> App is fairly easy to setup. My advice is to plug things in near hub first for setup purposes (or vice versa), then move them further away for use. Doing this helped me with range issues."}
{"Author": "ML Christensen", "Date": "December 25, 2013", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Great app BUT</span> The 2 way Audio does not work through this App. I had to purchase another App where it does work. Also, there is no way to have the camera move to preset positions. If these items could be added (i did email regarding this) I would rate it 5 stars no problem."}
{"Author": "Commodore Dave", "Date": "January 5, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Waste of time</span> I installed this App on my Galaxy S3 and it wouldn't even let me accept the license terms.  I tried numerous times, to no avail."}
{"Author": "Harold Laski", "Date": "July 23, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Does not work with Samsung Note 3</span> Keeps telling me to download new software. Then takes me to download site where it says installed."}
{"Author": "Dan Robinson", "Date": "October 1, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">It broke my camera.</span> My Insteon camera no longer works. Thanks!   Fantastic update. ...what did you fix?"}
{"Author": "William Skala", "Date": "August 23, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Wont install on HTC one max.  Says insufficient room but there is pleanty"}
{"Author": "Dave McDonald", "Date": "December 5, 2013", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Great app</span> I really like this app, the only thing that would make this app better for me would be if you could add the ability to control the PTZ cameras to look around."}
{"Author": "John Gacek", "Date": "October 16, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">So far, not so good...</span> I set up a basic thermostat and hub at home today, configured it as per instructions in the sheet of paper that came with the kit, and everything worked for a minute..  The app doesn't scale well to either my tablet OR my phone, and now the app doesn't read or show the configuration of the thermostat.  I'm amazed I spent money for this, as it is totally not the experience I had thought it would be."}
{"Author": "Kenneth Cho", "Date": "October 5, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Last update  is buggy</span> Now I cannot see the options on thermostat control."}
{"Author": "Joe Blair", "Date": "October 3, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Broken</span> New update wipes out camera. Once reconfigured it doesn't allow panning or tilting."}
{"Author": "Corry Rinehart", "Date": "September 16, 2014", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Love the automation but the app is lacking</span> I am happy but they need widgets and allow x10 into scenes.  I'm sure I will find other things as I use this app more that I wish I had"}
{"Author": "Garvin Clan", "Date": "October 2, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Recent update does not work</span> With recent update I can no longer view my camera 95% of the time.  When the camera does work, I can no longer pan/tilt the camera with the app."}
{"Author": "David Van de Vate", "Date": "January 10, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Does not work on my ASUS Transformer Prime</span> Starts going through check list and exits out."}
{"Author": "Ziad Turk", "Date": "August 28, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Doesn't work 75% of the time</span> Doesn't work for75% of the time, you have to restart hub many times to connect, both via wifi, and internet, most of the time it shows the yellow dot (undefined status) although on wifi, many complaints, and nothing happens."}
{"Author": "Jamie Chandler", "Date": "January 2, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Bad products….bad service.</span> Nothing working properly.  Been on hold with support for 42 minutes now before anyone picks up!  My guess is that they are overwhelmed with calls because their products are worthless.  Will be returning to store and buying products that actually work!"}
{"Author": "Erik Quarberg", "Date": "February 15, 2014", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Needs work.</span> I bought this stuff to be able to control my house when I'm away.  From what I found it works great when you're on the Wi-Fi connected to the hub. But when I'm on mobile with my phone, forget it, it can't connect to the hub. My wife had the same problem with her phone. Now I'm frustrated because u don't care about controlling the temp, lights and cameras when I'm already at home! I hope they fix this soon."}
{"Author": "Ze Wong", "Date": "July 23, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Pretty Terrible</span> Most shittiest application and set-up i have ever encountered  1) cannot connect to hub for a good hour 2) cannot add mini remotes  I have just setup HouseLinc and gave up on this terrible written app and setup"}
{"Author": "Erin Stanley", "Date": "July 4, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">waste of time!</span> This product is not user friendly! do not try to install this on a weekend or holiday when there is no support to help you. emails to the company can take up to 3 business days to reply. this product is so new the forums on the Customer Support site are all empty. tried all different ways possible to get this product connected to the wifi. it does not matter if it's hard wired or WiFi the system can't find it. when I did reach customer service their  only advice was to get Windows 8 ."}
{"Author": "Chris Freeman", "Date": "October 18, 2014", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Conistancy and features somewhat lacking...</span> Quit option only available under thermostat and not other modules (should be everywhere). Latest update took away the humidity readings from my thermostat. Recommend to add voice controls for scenes. Communication protocols or program robustness needs improvement for remote access over flakey/roaming cell data connections as i get disconnected frequently, but not over local/remote wlan with this app or other apps over cell data."}
{"Author": "James Dvorak", "Date": "September 6, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Would probably like it if...</span> Crashes almost immediately after starting. No issues with the iOS version..."}
{"Author": "Kris Becke", "Date": "August 20, 2014", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Needs updates</span> Needs to have landscape view and more buttons on a single page on favorite page.  The iPad app is way better than android version.  They need to put some time in to redesigning this app."}
{"Author": "Matthew", "Date": "January 31, 2014", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">works, but it'd be better with tasker</span> i have been using this app for a week or so, and it does the trick but logging in just to toggle a light is a pain. if there were tasker integration, i would create a task that can be launched from my homescreen. THEN this app would get 5 stars."}
{"Author": "Dan Kumm", "Date": "October 1, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">latest version messed everything up</span> How badly this update messed up my setup is what inspired this review.  Not only did Nest support NOT get added but all my room settings have been erased.....great update.  Ill leave this at 1 star until a fast fast fast update is applied to fix all this."}
{"Author": "Morgan Preston", "Date": "January 14, 2014", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Works well</span> Took some fiddling around with but now works without a hitch.  Remote use (not on wifi) is still a little bit hit and miss."}
{"Author": "Ken Leduc", "Date": "August 15, 2014", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">nest thermostat</span> All my research says the the nest thermostat is compatible with insteon. However linking it to the insteon hub is impossible. Can anyone post a step by step instructions because I have wasted 4 hours already. PLEASE HELP."}
{"Author": "", "Date": "October 9, 2014", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">What happened?</span> My app was working this morning, now it won't connect to the hub. Only works while I'm on the same Wi-Fi. Why? What happened?"}
{"Author": "Jeff Vanelle", "Date": "December 28, 2013", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Does not work on Asus Transformer prime</span> App installs, but shuts down instantly after authentication procedure. Works on my S3 tough"}
{"Author": "Michael Schiff", "Date": "January 9, 2014", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Works but needs improvement</span> Still has many bugs, such as the ability to force remove a device (I had a device that went dead and I was unable to remove it, so I called Insteon and they had to do it for me using an iPhone because they said this is still a known issue on the android app).  It has been several months and they still have not fixed this."}
{"Author": "James Riley", "Date": "March 10, 2014", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Gets the job done</span> It's a beautiful app but it is also glitch-prone and buggy. It's what you need to use with Insteon products."}
{"Author": "John McCarville", "Date": "July 20, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Crashes on Lenovo Yoga</span> Will not work on Lenovo Yoga. Even the report an issue function crashes."}
{"Author": "Jerry Kinkead", "Date": "February 19, 2014", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Great so far</span> Just got the hub and switch modules, downloaded the app and setup was simple. Configured port forwarding in my router and everything works great! Setup on Galaxy s3 and Transformer Prime and accessed remotely with both. So far so good."}
{"Author": "Edgardo Diaz", "Date": "October 1, 2014", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Basic app. Very limited.</span> What, no support for ittt? Glad to see the nest t-stat but insteon is too close of a system. Plenty of room for one or two rows."}
{"Author": "Jacki Clark", "Date": "October 15, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">If there was a \"0\" star choice I would have chose it.</span> Will not connect with the WiFi on my android phone. Windows phone worked ok... get too far away from home, maybe 20 miles your screwed. Can't view a thing."}
{"Author": "Alvin .Johnson", "Date": "April 16, 2014", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Works great</span> I can adjust t-stat, lights,  and camera in my house."}
{"Author": "Matt Kerr", "Date": "June 22, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Does nor sync</span> I'm not sure if this app does anything other than irritate the user. I couldn't get it to find my Wi-fi security camera on the network. So it won't allow me to login. Fail!"}
{"Author": "", "Date": "October 4, 2014", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Not good security system</span> Make app better with arm/disarm option... this app is BS... and you cannot setup notifications... why actual app notify that something is happening not that I get msg and email each time when I open or close the door... or walk next to sensor. You guys have great product but your app is not good at all... hire new software development team... regards..."}
{"Author": "Lukasz Mrowczynski", "Date": "July 9, 2014", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">3 stars for me</span> Everything works great, but if you are using multiple devices and you added a nest with a ios device you just screwed your android app experience. This is unacceptable! Where is the update with nest support for android? I understand two years ago when everybody was ape shat for ios, but today this is unacceptable. Don't become another RIM. That's how it starts."}
{"Author": "Matt Nisnevich", "Date": "April 11, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Crashes if nest is configured</span> I set up insteon for hub app on ipad.  Added my devices and Nest thermostat.  But when I use the same account to login into the app on an Android device, it just crashes when the app opens.   Doesn't let me remove nest or do anything else.  Just crashes few seconds after opening."}
{"Author": "Vijay Venugopal", "Date": "October 9, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Messed up</span> The new update completely messed up my setup. I can't see the thermostat settings and can't set either. First fix problems with your app then start thinking about Nest or whatever....disappointed..."}
{"Author": "Brett Murphy", "Date": "May 26, 2014", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Good but can be slow"}
{"Author": "Brian Faria", "Date": "December 16, 2013", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">App still does not work on my tablet</span> App still does not work on my tablet after newest update.needs work but was overall not bad until latest update and now my tablet wont connect at all, please help"}
{"Author": "Art Lloyd", "Date": "March 27, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">software sucks</span> this software needs lots of updates .... or done over .... if they want to sell the hardware .... then the software needs to be there to support it .... this could be a great product with he direction of someone who cares where this product and products are going ...."}
{"Author": "Jacob Sameck", "Date": "March 27, 2014", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Works Good</span> I've had no problems"}
{"Author": "Michael C Bork", "Date": "September 28, 2013", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Update rocks!!!</span> Love it! Works faster now on my android and ... love the audio button for the cams!"}
{"Author": "Eyal Zarchi", "Date": "December 4, 2013", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Can you please make it be for tablets?</span> There are two main features that are missing for me: If I open it on a tablet, I can't get it to rotate to landscape mode.  And please please add the feature to create events. Everyone is missing the option to create triggers based on device conditions."}
{"Author": "Yvan Huneault", "Date": "February 20, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Not ready for prime time</span> Uninstalled this week after a few months of trying. It would appear that the core of the Insteon system is quite sophisticated but this does not translate well in the app (which is the sole method of control). Unless you are grounded in the more arcane procedures of linking devices and using one or another as a controller, this will not work for you. Unfortunately, you are left to your own devices (as it were) to \"figure out\" how things work. Functions that should be simple and intuitive to program, are not. After the second or third time you turn off a light switch and watch every controlled device go out, or arrive (or wake) to find that a programmed sequence simply does not execute, you will move on. Take a look at Insteon's updated product documentation to get a feel for the complexity of the system. Unfortunately, at this level, \"you can't ge there from here\"."}
{"Author": "Anthony Robinson", "Date": "November 1, 2013", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Really needs an update.</span> Interface is clunky. Back button shouldn't log you out on the home screen. Why doesn't this app have widgets?"}
{"Author": "Brad Arthur", "Date": "August 21, 2014", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Works great</span> I'm not sure what app others are using! This works great for me. No issues, easy setup. Does exactly what I want"}
{"Author": "Rich Stevenson", "Date": "November 28, 2013", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Much better</span> Going back and forth from home to Internet, connects in seconds now. Huge improvement!"}
{"Author": "Paul Vild", "Date": "December 3, 2013", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">program tasks long to refresh</span> able to access schedule now.  still very slow to refresh.  devices are buggy and sometimes just quit working"}
{"Author": "Ganbold Badrakh", "Date": "August 17, 2014", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Amazing</span> Cool"}
{"Author": "Jean-Carlo Arizaga", "Date": "October 7, 2013", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Great system with average app interface. Too many clicks on an icon to dim a light. Widgets are necessary."}
{"Author": "Brandon White", "Date": "August 19, 2013", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Huge step down from Mobilinc</span> Finicky setup of the insteon hub is the first frustrating part of this software, but luckily you'll forget about that once you actually try to use it. With the older mobilinc software and the 2412n controller I had widgets on my homescreen that allowed easy, one touch on/off operation. Now I have to open the app, find the device/scene, select it, then use the stupid virtual switch. No widgets also means all my NFC tags I used when leaving, going to bed, etc are useless now too."}
{"Author": "Joe Strickland", "Date": "December 1, 2013", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">App crashes now while setting up schedules</span> Update is a *BIG* step backwards in stability/functionality for me.  App now crashes whenever I attempt to add or edit a schedule to a scene or decice.  I've lost the ability to schedule anything now, so my primary use for the hub and 15 devices has been undermined.    I've read that another user had this issue with the new update on their Android smartphone as well, but was able to gain success on their IPad. I dont own one so can't quite try that for now."}
{"Author": "Joerg Meyer", "Date": "December 3, 2013", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Camera password does not allow special characters</span> Great improvement over previous versions of the app.  The current version does not allow adding a camera when the camera password contains a special character, such as underscore '_', period '.' or parentheses '( )'."}
{"Author": "Peter Hansen", "Date": "December 2, 2013", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Very poor product</span> Crashes when setting up devices and tech support is poor!!!"}
{"Author": "Brian Fanson", "Date": "December 11, 2013", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Stopped working on my tablet."}
{"Author": "La'Shauna Jones", "Date": "August 28, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Does not connect"}
{"Author": "Ian Bergman", "Date": "September 29, 2013", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Utter crap</span> Purchased this with the expectation that I could replace the pc-dependant HouseLinc. But the configuration is so cumbersome with no ability to add devices that are hidden that it is essentially useless."}
{"Author": "Adam Pollack", "Date": "December 3, 2013", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">A few improvements for 5 stars!</span> 5 stars if widgets (multiple) added. UI could be more Android like as well. Overall it works well and there have been updates."}
{"Author": "Brett Prior", "Date": "December 1, 2013", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Crap,</span> Just doesn't work at all"}
{"Author": "Justin Sitton", "Date": "December 1, 2013", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Ick</span> I can't edit schedules on andriod.  I went through my phone, and 3 tablets trying to edit schedules.  Each time the app would just exit every screen.  It did not even cause a crash report.  I had to log back in after it exited.    I had to use an iPod to change a schedule for a scene.  Thanks for making us android users second rate citizens in your application development."}
{"Author": "Dan Flores", "Date": "September 28, 2013", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">I had my doubts</span> But wow, Insteon has come a long way.  This app makes setting up your devices a breeze."}
{"Author": "kevin bateman", "Date": "January 10, 2014", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Too cool to be able to turn on and off lights remotely.</span> Watch cameras and adjust the thermostat from the office."}
{"Author": "Ceddy F", "Date": "December 2, 2013", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Schedules cause crash.</span> Please fix crashing on schedules.  Both on Android 4.0.4 and 4.3"}
{"Author": "James Riley", "Date": "March 10, 2014", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Gets the job done</span> It's a beautiful app but it is also glitch-prone and buggy. It's what you need to use with Insteon products."}
{"Author": "J Getrum", "Date": "July 24, 2013", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Serious Flaws.</span> Exactly the kind of app that a programmer should be sentenced to use for all of eternity for producing.  Desperately needs widgets.  I just want to press one button to turn a light on and off... But using this app I have to: Open the app, Find the right room, Press the light, And then turn it on and off using a virtual switch...  And why even have the virtual switch, the icon tells me if it's on or off already, just toggle the state when i click that, unless it's a dimmer and actually needs another level of interface.  Also, why do I have to add every switch to All devices, and then add it to rooms.  I have to give them longer names to keep them sorted this way.  Every single room has a light and a fan, so why not make a sorting system that understands the basic way that electric devices are arranged in a house?"}
{"Author": "William Marshall", "Date": "October 5, 2013", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Works</span> With each update things keep getting better! I'm now using V2 of the hub, thanks for the free upg for early adopters. Its sooooo much better. With some UI tweeks this app will be exactly what I'm looking for: A toggle option for none dimable units rather than a popup panel. More rows in the app, a widgets for android so I can have scene buttons on the launcher. A Plugin for locale/Tasker would be great and allow for some conditional responses. Some basic logic for Scenes would also be greatly appreaciated."}
{"Author": "Neil Sprangers", "Date": "November 15, 2013", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Junk</span> The only thing worse than the app is trying to deal with insteon support.  Don't waste your money."}
{"Author": "John Szentes", "Date": "December 2, 2013", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Lousy - deserves negative stars</span> Me 2 on not able to change device schedules anymore.  Do they test this crap before releasing it?"}
{"Author": "John David", "Date": "January 12, 2014", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Great compliment to the hub</span> Works as advertised, allows you to connect directly to all bulbs and switches. Great app."}
{"Author": "Rebecca C", "Date": "April 15, 2014", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Yes Jarvis</span> like"}
{"Author": "Matt Plucinski", "Date": "August 1, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> No support for Nest even though website states there is"}
{"Author": "Tony Lin", "Date": "November 12, 2013", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">T Lin</span> Simplicity is good. Few buttons do not work properly, like location, the popup does not do anything useful. My hub's time is off few hours, but cannot find a way to reset it. Please do something.  Schedule is not useful, can only set one timer. We have to create multiple scenes for the purpose. This is too tedious. Validation kick off too early when setting timer's time. Always has to retype user name and password after logout even remember is on."}
{"Author": "Vaun Norwood", "Date": "June 2, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Don't bother downloading"}
{"Author": "Andy Clay", "Date": "November 13, 2013", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Not a good start</span> I am always amazed at how programmer's miss the obvious basic things. You ask for a phone number when creating a new account in your app. It might be wise to change that label to cell phone number since your sign up process says it's going to send a text to validate the sign up request and it only informs your new users after it to late that the phone needs to be a cell number. Man oh man... Keep the eye on the ball will ya. Very bad first impression"}
{"Author": "Jim Scott", "Date": "December 4, 2013", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">All fixed, much better!</span> Team fixed the issues. Everything is working great now."}
{"Author": "Richard Hill", "Date": "December 4, 2013", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">OK so far</span> An earlier review of mine complained about the on-screen keyboard support, this was my mistake! All is good."}
{"Author": "Todd Kelmar", "Date": "September 11, 2014", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Improved UI</span> New UI is a huge upgrade."}
{"Author": "A Google User", "Date": "October 7, 2012", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">What hardware do I need?</span> The app instructions say this is compatible with \"INSTEON Hub.\" But there is no such thing on the market - only the Smartlinc Hub. But then the description says it's not compatible with that. So what do I need to use this app??"}
{"Author": "Thomas Day", "Date": "December 23, 2012", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Not ready, yet</span> This app fell far short of it's implied capabilities.  The Hub seems to have the ability to do it's job, but the software cripples the hardware.  As a professional installer, the products I install have to work, and this is far from being plug an play.  Hopefully future updates will resolve the numerous faults in this product, and I will gladly repurchase the hardware."}
{"Author": "John Shuman", "Date": "April 23, 2013", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Doesn't work. Useless.</span> This works up to a point on my Nexus 4 phone, completely useless on Nexus 7, can't find the hub despite being on the same network as the phone. First experience of Insteon, not impressed,  app isn't intuitive or well designed and reliability of software and hardware are poor.  Update: now refuses to connect to any device. This is absolutely useless, will be uninstalling and contacting the hardware vendor for a refund."}
{"Author": "Patricio Munoz", "Date": "January 13, 2013", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Wow, easy setup!</span> Okay they designed this product right for average consumers.  The setup was incredibly easy... that said I am having troubles connecting to the hub outside of my Wi-Fi... so I have to figure out why.  They need to make this part easier.  For example allow me to log into the cloud but provide me with possible solutions as to why I am having troubles connecting remotely."}
{"Author": "Lissa Nash", "Date": "January 2, 2013", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">I am looking forward to updates</span> I've been using this with only lights for two weeks now. I love the idea, but the reality leaves a bit to be desired.   1) It would be helpful for there to be a place one can type in a dimmed percentage because the app doesn't respond quickly or accurately to touch.   2) I'm unable to access the Hub from 3/4G. The app only recognizes the Hub if I'm on my home wifi. This makes it rather frustrating because I primarily bought this system to be able to  turn on lights before I come home at night.   I know this is brand new and I'll try to be patient, but I am waiting to see what happens before I invest any more in this line."}
{"Author": "Samson Fascinate", "Date": "February 1, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Dear Insteon team: HIRE A UX DESIGNER! I am a ux designer and it took me way too long to set up your convoluted app with ambiguous terminology. I cringe at the thought of an average user trying to use this. It is hands down the worst, unusable app I have had the displeasure to lock myself into. Honest question, do you guys even try the software you ship?! Test this app with minimum 5 users and you will uncover the usability nightmare issues that plague this app. I have to KILL the app every time I launch it to get the modules to show their status and control them. Absolutely unacceptable in 2017. I repeat: HIRE A UX DESIGNER OR YOU WILL FAIL AS A PRODUCT. I will change my rating when you fix the status not showing on first run issue."}
{"Author": "Dr David Neskar", "Date": "June 12, 2013", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Works great keep the updates coming</span> Switched over from x10 to insteon and not looking back. Every update to the app has been a significant improvement. Works as intended. For those with complaints remember  \"its not usually the car, its the driver\""}
{"Author": "Mike Nunes", "Date": "January 8, 2013", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">insteon for hub for android</span> I already had quite a few insteon products in my house and was used to using HouseLinc to set things up.  Now I'm not tied to the computer to do setup, just walk around with my phone and tap to add them. Added an open close sensor to my garage door and back gate so I can get an email and a text message when they open or close.  I have UPnP turned on in my router and the hub installed quickly without any problems. It's slow to get to it when off my network but it does seem to finally connect.  Scenes aren't as powerful as HouseLinc and a couple took a few tries to get right. I agree with whoever mentioned timers needing some upgrading - HouseLinc is still going to be running most of my schedules at least until the next version comes out.  I got one of my 2 IP cameras to install right away, the second camera took a bit of work but that could have been a problem with my network or the distance of the camera from my router.  I like where you're going with this, looking forward to the next update."}
{"Author": "einar rosenberg", "Date": "March 4, 2013", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Love it but needs to load and connect to hub much faster</span> Biggest complaint I have is that when I run it, it takes forever to find the devices on my network and link to them so that i can control them. But it's a great product over all and I've tried everything from super expensive systems to inexpensive ones like X 10. And this one is by far the one with the most potential. Don't expect it to work well in apartment buildings"}
{"Author": "Sam Solarz", "Date": "January 1, 2013", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Nice when it works</span> Nice when it works.  Issues connecting to hub after closing app."}
{"Author": "Susan Burgess", "Date": "December 26, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Bad app</span> The most difficult,  time consuming,  and too many steps to go through in order to set up. After 3 days struggling to connect android to ethernet  (without hub), I'm still not connected.  There's also issues with entering my passwords. I set the password and user name, then go back to log in, and I get either error or cannot recognize my user name or password! Extremely difficult app. Not worth it. And to think back why I purchased this to begin with, which was the convincing explanation of Plug &amp; Play ease"}
{"Author": "Carl Short", "Date": "February 20, 2013", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Working a lot better after updates</span> Would like to see more features like support for multiple hubs for the same account."}
{"Author": "bassi mike", "Date": "April 27, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">absolute junk. buyer beware.</span> If I could give this \"0\" stars I would. Where should I start? I went to home depot and looked at the signs \"easy to setup and \"wireless\". Neither of which is true, nor is stability and range. If you hook this piece of junk up and it finds the guest part of the wifi you're screwed because you cannot get off the guest wifi and my android phone on the new s5 could not find or sinc up with this crap. I am almost an expert computer user and no one here could figure it out. We did get it to sinc up once for about 2 min then it quit again. Buyer beware. Total garbage."}
{"Author": "Barbara Bauer", "Date": "December 21, 2012", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">INSTEON FOR HUB</span> Is there going to be a revision to this software anytime soon? App is very limited in the current version. Tryed to remove an older Insteon devise and app kept crashing. Never did let me remove device."}
{"Author": "Step Cia", "Date": "May 14, 2013", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">It works... But i have to buy a new router</span> Bought a new latest linksys router EA4500 and now it works. My previous router was Linksys WRT120N. There was no list of incompatible router in their website... So if yours doesn't work out of the box. It means time to get a new router..."}
{"Author": "Joseph Ogle", "Date": "July 20, 2013", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Great home automation software.</span> Just recently began automating home and have had no problems with the app. Using camera, thermostat and lamp controllers. Small learning curve so all should be able to use."}
{"Author": "C Spradlin", "Date": "January 10, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Trouble with hub!</span> Don't want to hate it but right now I'm really disliking it... Wifi is good, reset router, uninstalled and reinstalled app, reset hub, check connection status....going into 8 hours of trying to get the app to configure the hub that can see my wifi n connects ok. It loses it and fails at hub configuration. Nice gift if it would only work..."}
{"Author": "Vance Shaw", "Date": "July 3, 2013", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Downloaded update, now nothing works."}
{"Author": "Pamela Peake", "Date": "April 20, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Purchased hub and camera today... spent 5 hours trying to set this thing up.  Works than doesn't.  \"UNKNOWN ERROR\" Really? camera settings have picture flipped when \"no\" is indicated. just too much work setting up. Getting returned tomorrow, hub and all.  Not worth $200 +.  Not impresssed with instructions or app.  Wasted a lot of time and cash."}
{"Author": "Andrew Hokenson", "Date": "April 18, 2013", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">No bueno</span> Works about 15% of the time. No easy way to delete scenes."}
{"Author": "Tico mas", "Date": "March 30, 2013", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">It does not work over LAN</span> if you dont have internet you can not use it. All the setting are in the cloud. Si internet falla tu no lo puedes usar bajo lan.o wifi. Espero que exista una actualizacion para corregir este problema."}
{"Author": "Brandon White", "Date": "August 19, 2013", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Huge step down from Mobilinc</span> Finicky setup of the insteon hub is the first frustrating part of this software, but luckily you'll forget about that once you actually try to use it. With the older mobilinc software and the 2412n controller I had widgets on my homescreen that allowed easy, one touch on/off operation. Now I have to open the app, find the device/scene, select it, then use the stupid virtual switch. No widgets also means all my NFC tags I used when leaving, going to bed, etc are useless now too."}
{"Author": "Matt Borchardt", "Date": "January 6, 2013", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Ok</span> This app has loads of potential. There are still many things that need to be updated: The timer currently only allows for one on off The camera does not have sound or motion sensor capabilities through this system The app only seams to work for a couple days then I have to reinstall You cannot create scenes yet  Like I said there is loads of potential and this is a new app and I am waiting for updates!"}
{"Author": "Yeni Vasquez", "Date": "September 25, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Unable  to download app</span> Over  3 hrs and still have not downloaded  it sucks...."}
{"Author": "Ayumi Yuna", "Date": "November 26, 2014", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Recent update broke previously working functions</span> They may have tried to add nest support, but now support of their OWN insteon branded thermostat no longer has humidity featured! Is this a joke? Was bad enough that it is unable to edit or use thermostat programs/schedules, now you take away humidity display? Not to mention now the check in group is empty."}
{"Author": "Raf Gonnissen", "Date": "December 13, 2012", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">bunch of crashes</span> seems like the app is not finished yet, although help functionality with videos is pretty good. a lot of crashes... htc evo 3D ics"}
{"Author": "A Google User", "Date": "September 28, 2013", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Rarely works on android, don't bother"}
{"Author": "Mike Lozevski", "Date": "December 21, 2012", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Freezes up and super long logon times</span> Works only about 20% of the time if you can even log on. If you log on from a remote location with an android phone it is guaranteed to freeze up. Works ok with an iPad but is horrible with HTC or Samsung devices. It's a shame it was released with so many deficiencies gives insteon a black eye.  Needs to be returned asap."}
{"Author": "Ian Danby", "Date": "January 8, 2013", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Limited, buggy.</span> Device and scene names aren't synced to hub and Link management is non-existent, so when you install homesync to manage your links you have to redo a ton of work. Cannot handle keypadlinc buttons correctly either.  Crashes too easily and has too many \"not yet supported\" features.  Disappointed."}
{"Author": "ad writer", "Date": "May 19, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Just plain bad.</span> Connection issues. Memory hog. Ugly user experience. There isn't anything good about this app. It'll be a waste of time and background data if you choose to install it."}
{"Author": "Joseph Haddad", "Date": "March 27, 2013", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">works woth android 2.3.4 droid3 over 3g connection</span> works great once setup, even set up the web server part so i can access it from my computers, i did have to enable upnp on my ddwrt router for it to work over 3g. im using a stock droid 3 android v 2.3.4. even works well with my old x10 devices"}
{"Author": "Mike Romano", "Date": "January 18, 2013", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Great new product</span> Love being able to check and change the status of my home while away or in the house"}
{"Author": "Tom M.", "Date": "May 8, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">We're Getting There</span> I've had this app since the beginning, since I've had Insteon devices for any many years now. It's made significant improvements since then and it works great for me. I love controlling my devices from my phone. Even better, I love setting up my devices from my phone. The app *still* doesn't support various devices, my IR to insteon device, my mini handheld remote...?? Why not!? Also, as others have said the UI is pretty horrible, please Android-ize!"}
{"Author": "Lonny Spitz", "Date": "January 23, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> I installed Insteon products all over my house a 3 months ago and everything worked great..the app was amazing and so was customer service. Something went wrong out out of nowhere. ..about a month ago I received an update to the app and it stopped working..the app keeps crashing and I am unable to get through to customer service. .I have tried 6 different times and hang up after waiting for an hour each time. Wondering if others are experiencing the same issue with the app."}
{"Author": "Zeb Reardon", "Date": "July 2, 2013", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Works gr8</span> Love it"}
{"Author": "Derek Howard", "Date": "May 27, 2013", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">New product with limits</span> The old system seems to have been much better. Hub has a greater potential, but they released this product before integrating older components such as fanlinc and houselinc. Products that are compatible are still badass though. To be continued."}
{"Author": "David Kump", "Date": "June 23, 2013", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Good, not great</span> A little difficult to setup, but you can call support for assistance.  I found the manual online and was able to get port forwarding configured and all is working fine.  It walks you through the steps well.  Configuring devices not intuitive, but fairly easy.  Just wish you could schedule random on/off times.  Once configured, it works very well."}
{"Author": "mac L", "Date": "December 12, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Doesn't work</span> The app is horrible an so is their customer service. I emailed multiple times with no response. Not sure what changed, but they have gone down hill."}
{"Author": "Clarence Bell", "Date": "December 16, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Too inconsistent</span> Don't know if I have the app on too many devices but it's way to finicky.  Works sometimes on some devices. Sometimes it does not connect to hub, then it does without changing any settings.  Need to be rock solid from device to device. Seems it doesn't get configuration from the hub when requested. Schedules don't update causing devices to run on old schedules. My biggest pain?  Why can't the hub/app turn off or on devices at the same scheduled time without having to add them to a scene?  Even scenes cant."}
{"Author": "Rapheal Golden", "Date": "October 22, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Failed out of the gate</span> Followed directions and it still isnt working, the device is online but its not connecting,  argh my lutron worked flawlessly. I cant recommend this device to anyone."}
{"Author": "Ryan McCormick", "Date": "January 18, 2013", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Worth it?</span> Should I cancel my order?  My ISY26 sucks via phone, as does the smartlink web app.  If this HUB app is no better...  shame on SmartHome"}
{"Author": "William Terry", "Date": "April 1, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Works well, keep improving"}
{"Author": "Brushworks Painting", "Date": "November 26, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Won't work with any of my android devices whole system is garbage</span> No android devices work"}
{"Author": "Ashok Patel", "Date": "April 15, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Doesn't work.</span> Company should look at all the 1star rantings"}
{"Author": "Yong Huang", "Date": "March 8, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Cannot pass the splashing screen</span> Crash after authentication immediately."}
{"Author": "Nathan Weishuhn", "Date": "January 1, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Have Ben trying to install on phone for 3 days still won't install</span> Garbage app"}
{"Author": "Charles Goldman", "Date": "March 3, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Unable to set up device with app.  Call to support waiting over 15 minutes with no answer.  Sending back to Costco."}
{"Author": "", "Date": "May 23, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Why it wants \"device and app history\" permission?"}
{"Author": "Hugo Rivera", "Date": "August 12, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">App not working</span> The latest update ruined the app on my galaxy s6 edge closes when ever i try to control anything in my hub."}
{"Author": "r king", "Date": "August 13, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Don't waste your</span> Time.  The application does not seem to work on my phone"}
{"Author": "Enosburgh Ambulance Service", "Date": "June 25, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Lame</span> App needs overhaul,with wear support"}
{"Author": "A Google User", "Date": "February 1, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Insteon</span> Doesn't work."}
{"Author": "", "Date": "February 12, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> This app socks can't figure nothing out or link anything to this pos"}
{"Author": "allen m", "Date": "December 8, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Bugs, bugs, bugs</span> App crashes when accessing modules to post on or off and the setup is not always intuitive"}
{"Author": "Austin Gray", "Date": "August 12, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Bought a $100 camera and now returning because I kept getting Unknown Error. Tried uninstalling moving camera location. Nothing worked POS."}
{"Author": "charlie gold", "Date": "July 22, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Works on my iPad, but says \" failed authentication \" on my galaxy s7 and galaxy tab a."}
{"Author": "Kyle Kopp", "Date": "December 27, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Would not connect to hub on the same network.  Returning the starter kit as there is no other way to manage it other than through the app."}
{"Author": "Texas Red's Total Outdoors", "Date": "July 30, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Sucks couldn't get it to do anything. Looks easy but won't do anything"}
{"Author": "Robert Celidonio", "Date": "January 10, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Worked for two days, now app won't connect to my Hub. Same app on iOS works fine at my home..."}
{"Author": "", "Date": "February 25, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Won't talk to hub no matter what"}
{"Author": "chris d", "Date": "November 11, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Does not work regularly</span> Have to constantly reinstall app to gt it to work"}
{"Author": "Nisheeth Sharma", "Date": "December 5, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Doesn't launch</span> Crashes continuously in the background. Had to get an iOS device to set up my insteon hub"}
{"Author": "Kris Becke", "Date": "September 4, 2014", "Stars": " Rated 3 stars out of five stars ", "Text": " <span class=\"review-title\">Good but</span> Needs landscape mode. Ipad app is much better than the android version."}
{"Author": "Phil Reinie", "Date": "September 19, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Package file invalid is all I get</span> All I get when i try to install is package file invalid. Is it because I try have android 2.3.4? Plus I don't like to allow access to all the stuff they want. Individually as needed okay but not all or nothing."}
{"Author": "Manuel Robledo", "Date": "February 4, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Needs Landscape Mode for Tablets</span> Been using this app on iOS and recently switched to Android.  The Android version is not as refined as the one for iOS.  Needs some rudimentary UI improvements."}
{"Author": "Sean Cory", "Date": "June 1, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Can't even create an account! Failed many many times!$#^#/#&amp;"}
{"Author": "Eric Gruver", "Date": "March 28, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Doesn't even work....!!!</span> No good!...At all....Did everything it said....everything I have is brand new and nothing will connect...I give it a ZERO!"}
{"Author": "Michael Schweiss", "Date": "January 3, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Terrible!!!!</span> Won't ever connect!!!"}
{"Author": "Doug Depiero", "Date": "October 12, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Cant even download new version.  Old version work great new,version doesnt"}
{"Author": "", "Date": "June 18, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Make it like the iOS app!!</span> The interface looks like this was made when Android Ginger Bread was out. You guys can do much better!"}
{"Author": "Osama Kergaye", "Date": "March 20, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Can't even download</span> Is the only app IV seen that failed to install every time I try and download and install it....."}
{"Author": "Michael Brady", "Date": "June 10, 2014", "Stars": " Rated 2 stars out of five stars ", "Text": " <span class=\"review-title\">Crashes.</span> I love the Insteon products, and the iPhone app works great -- however this Android app just crashes after it loads."}
{"Author": "Robert Sexton", "Date": "September 11, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Hijacked</span> I tried to install this but all I got was a bogus taco Bell page."}
{"Author": "JC Trembley", "Date": "January 12, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Will not connect</span> Failed out of the box did the resets did nothing at all will never connect called customer service got a call back to be hung up on total joke of a company"}
{"Author": "Andrew Rossignol", "Date": "January 4, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": " <span class=\"review-title\">Confusing UI, but works otherwise.</span> I don't care for the UI of this app. It takes too many taps to do simple things like switch on a lamp."}
{"Author": "mac L", "Date": "December 12, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Doesn't work</span> The app is horrible an so is their customer service. I emailed multiple times with no response. Not sure what changed, but they have gone down hill."}
{"Author": "A Google User", "Date": "November 13, 2012", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Insteon Hub announcec 11/13/12</span> To the reviewer that was concerned that there is no product called \"Insteon Hub\".  It was announced by general email today, and will ship by 11/30/12.  Check the Smarthome Webpage"}
{"Author": "James Suing", "Date": "October 11, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Will not work</span> Every time I open it, it disappears."}
{"Author": "Geraldine Buniao", "Date": "October 12, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Not worth $$$</span> Should of read the reviews first before purchasing a lot of equipment.  Save your $$$."}
{"Author": "", "Date": "August 3, 2014", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\">Licence</span> Could not get accept check box to check."}
{"Author": "Johnny giron", "Date": "June 17, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Can't. Sing in. It sucks"}
{"Author": "Arrow Cal", "Date": "April 3, 2015", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Just wanted</span> Sup girl 👧"}
{"Author": "Alborz Amini", "Date": "September 18, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> no remote connection. terrible interface."}
{"Author": "Ava Kafoury", "Date": "December 7, 2014", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Awesome</span> Works perfect. Awesome customer support."}
{"Author": "Texas Red's Total Outdoors", "Date": "July 30, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Sucks couldn't get it to do anything. Looks easy but won't do anything"}
{"Author": "Shibiao Lin", "Date": "May 22, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Terrible app"}
{"Author": "Goran Manev", "Date": "July 26, 2015", "Stars": " Rated 5 stars out of five stars ", "Text": " <span class=\"review-title\">Top</span> Top"}
{"Author": "Derek Penner", "Date": "April 16, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " <span class=\"review-title\"></span> Please use standard android design pattern."}